{
  "jobs": [
    {
      "slug": "Oah37TcnalB",
      "link": "https://jsjobbs.com/javascript-jobs/Oah37TcnalB-full-stack-developer-blanc-labs",
      "title": "Full Stack Developer",
      "description": "Velocia belongs the the Blanc Labs Group of Companies.\n\nVelocia is a mobility rewards platform partnering with transit agencies, private mobility services operators and municipalities to influence and engage people on their daily commutes. Velocia’s platform is designed to incentivize and encourage people to get out of single occupant vehicles, and into any other form of transit, with a mission to help reduce traffic and carbon emissions and improve the way people get around in their cities. For more information, visit www.velocia.io.\n\nWe are seeking an intermediate to senior-level Full Stack Developer to join our team of like-minded technologists to build and enhance public transit ridership solutions.\n\nThe ideal candidate will have 3+ years of software development experience in React or Angular on the Front-end and Node, Ruby or Java on the back end. We are open to fully remote people in Canada, but if you live in the Toronto area you have the option to work from the office in a Hybrid fashion if you so choose.\n\n### What Will You be Doing\n\n* Developing and enhancing current and new solutions on our platform\n* Hands-on development using a variety of frameworks and tools, mainly using modern JS frameworks\n* Code reviews, testing and working side-by-side (virtually) with more senior team members\n\n### What Do You Need to be Successful\n\n* At least 3 years of experience with Javascript (NodeJS, Typescript, AngularJS, React, etc...). Especially, must have used React in production level with proper redux / or other suitable state handling design\n* At least 2 years of experience with cloud infrastructures (directly or indirectly), and familier with software design and data structure\n* At least 2 years of experience in full-stack (BOTH front-end and back-end) development\n* Ideally with one other language different from Javascript (Ruby, Python, PHP, etc...)\n* Worked with proper unit test and integration test\n* Have experience with SCSS, Less\n* For the backend, should have worked with one of popular sql database (PostgreSQL, MySQL) and have experience with ORM\n* Have knowledge with token exchange and multiple authentication integrations\n\n### Nice to Haves\n\n* Previous experience working for startups\n* Experience with AWS (ECS, SQS, RDS, Lambda, etc...)\n* Experience with ETL processes (using Spark-like tools like AWS Glue)\n* Experience with PySpark or other data handling tools\n* Experience with Infrastructure as Code tools (e.g. Terraform, CloudFormation, etc...)\n* Experience developing mobile applications (IOS, Android)",
      "datePublished": 1666444350862,
      "companyName": "Blanc Labs",
      "companyLogo": "",
      "countryName": "Canada",
      "countryAbbreviation": "CA",
      "state": "Toronto",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["typescript", "node.js", "react.js", "mysql", "angular"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "JZYdMBmocseliF",
      "link": "https://jsjobbs.com/javascript-jobs/JZYdMBmocseliF-frontend-engineer-es8-react-redux-saga-filescom",
      "title": "Frontend Engineer (ES8/React/Redux/Saga)",
      "description": "Are you an expert at React, Redux, Webpack, browser APIs, ES8, and the rest of today’s modern frontend stack? Do you want to work on a web application used by hundreds of thousands of users?\n\n\nIf so, we’d like you to learn about Files.com!\n\n\nAt Files.com, we’ve invested heavily in the React/Redux platform and are looking to expand our growing team of frontend developers. As a frontend developer at Files.com, you will work on all of our client-facing web applications that are primarily written in Javascript targeting a web browser.\n\n\n**Additionally, you will get the opportunity to work on mobile apps using React Native as well.**\n\n\nOur frontend developers are responsible for all client-side code that runs in browsers and mobile apps here at Files.com. We use state-of-the-art tooling, such as React 16, Redux, Redux-Saga, and React Native on the mobile side.\n\n\nWe obsess about testing, code reviews, and keeping production code size low.\n\n\nFiles.com currently has many features that are available in its API that are not available in its frontend UIs, so a considerable part of this job will be building out new features and releasing them to customers as soon as they’re ready.\n\n\n### Here are some example projects that our Frontend Developers have worked on recently or will work on soon:\n\n\n* Rebuilding our internal CRM dashboard in React.\n\n\n* Building a browser-based file uploader that works in all browsers, supports resume, and is able to automatically detect the closest server for uploading.\n\n\n* Building notification panes that show “push notifications” to our users about updates to their files or workflows.\n\n\n* Enhancing our security by adding several new Two-Factor Authentication methods, such as U2F, SMS, and Yubikey.\n\n\n\n\n### Minimum Qualifications:\n\n\n* 5+ years of applicable experience.\n\n\n* Experience building and delivering React/Redux applications that have seen actual production usage.\n\n\n* Understanding of the language features of ES6 and ES8.\n\n\n* Understanding of common browser APIs and recent extensions to the HTTP protocol as they relate to frontend development.\n\n\n* Understanding of how to write secure frontend code and an awareness of common web application security vulnerabilities.\n\n\n* Testing and the ability to write unit tests/specs (we use popular JavaScript testing frameworks)\n\n\n\n\n### Preferred Qualifications:\n\n\n* Experience with at least one major Redux side effect library such as Redux-Thunk, Redux-Saga, Redux-Loop (We use Redux-Saga).\n\n\n* Contributions to major open source projects.",
      "datePublished": 1666443373543,
      "companyName": "Files.com",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Scottsdale, AZ",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["react native", "react-redux", "redux-saga", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "2RrhFDrekcitS",
      "link": "https://jsjobbs.com/javascript-jobs/2RrhFDrekcitS-software-engineer-sticker-mule",
      "title": "Software engineer",
      "description": "**About Sticker Mule**\nSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\n\nThe Software team is responsible for building and maintaining our front-end and back-end services, developing new features and products, and troubleshooting problems.\n\n**See more about our teams here**\n\n**We offer**\n1. Remote work with flexible schedules\n2. Varied, interesting technical challenges to solve\n3. A fun \"no bullshit\" work environment\n\n**We like you to know**\n1. Docker\n2. NextJS\n3. React\n4. NodeJS\n5. GraphQL\n6. Postgres\n7. Redis\n8. Familiarity with Ruby\n9. Excellent communication skills (English)\n10. Degree in Computer Science or equivalent practical experience\n\n**Challenges**\n1. Improve and expand our React shared components gallery\n2. Migrate a large Rails code base to JavaScript front-ends and back-ends\n3. Maintain optimal front-end performance on desktop and mobile\n\n**Compensation and benefits**\n1. $112,000/yr\n2. $20,000 signing bonus\n3. 28 vacation days (+ holidays based on your country of residence)",
      "datePublished": 1666441717843,
      "companyName": "Sticker Mule",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "New York, NY",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["nextjs", "node.js", "redis", "docker", "graphql"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "iq9PO9orelpmiS",
      "link": "https://jsjobbs.com/javascript-jobs/iq9PO9orelpmiS-senior-rails-react-engineer-simplero",
      "title": "Senior Rails + React Engineer",
      "description": "**Hey, my name is Calvin, and I know how you feel.**\n\nBecause...\n\nEven though I am the founder of the successful online platform Simplero.com and – might I add – I’ve been blessed with a wonderful staff of intelligent and kind people from all over the globe, things were not always like this.\n\nI spent many a dark hour figuring out why being awkward in the company of other human beings made me become great at developing software.\n\nPart of that is probably that being broken and alone is a good motivator for developing skills as a programmer.\n\n* But for many other things in life?\n\n* Not so much.\n\n* Anyway, today I’m happy to report that I enjoy the best parts of both sides.\n\n* The light side of having mastered the art of focus and logical thinking.\n\nAND...\n\nHaving great relationships and being able to build a strong organization with an incredible team and massive growth potential.\n\nBut alas.\n\n* A dark and evil power is upon us.\n\nAnd this…\n\n* ...is where you enter the story.\n\nYou will be the Superman who is called upon to hammer the villains back into the abyss from whence they came.\n\nOops. I got carried away...I do that. \n\nThe truth is, I’ve become the bottleneck of my own success, and I need a few more exceptional people who can help in our fight against evil.\n\nI mean that part, by the way. Jokes and corny comic book metaphors aside...what we’re doing is important. We’re out to change the world, and we need your help.\n\nSo what do you say..?\n\n**Do you want to play, or don’t you?**\n\nUnder this you’ll find the usual “features and benefits,” but don’t let that keep you from raising your hand if you feel a connection after reading this.\n\nYour friend in the good fight,\n\n**Calvin Correli**\nCEO and founder of Simplero\n\n\n### What’s in it for you:\n\n* Be your own manager with leeway to decide how you spend your time.\n\n* You’ll be able to point to exactly what you created, both features and open source projects that we release.\n\n* With just 4 engineers we created what other companies take armies to make, and we'll teach you how to do it yourself. Welcome to the 100x club!\n\n* You get to see how great it feels when you grant someone's wish that mighta took you 4 minutes, but totally makes their day!\n\n* Salary range: $50k-$100k US/year.\n\n### Benefits:\n\n* 4 weeks of paid vacation per year, increasing to 5 after three years. Plus 10 sick/health days and 10 national holidays. Time away from work brings fresh insights.\n\n* Wellness stipend to help pay for your gym. Deadlifts make you smarter.\n\n* We'll pay for a laptop or other gear you need to be productive.\n\n* We’ll pay for an audible membership. Books also make you smarter.\n\n\n### What sets Simplero apart:\n\n* No VCs. No outside funding. No exit strategy. We do it because we love it today, and want to continue doing this in perpetuity, not because we hope to make out like bandits in the future.\n\n* We're profitable and have been in business for 13 (!) years . It's a solid, stable, proven company, product, and model, not some fly-by-night operation or risky gamble.\n\n* We have 2,500+ active customers who have made well over $300M using Simplero. We’re the real deal.\n\n* We're founded by a developer (Calvin) who is still personally and passionately leading Product and Engineering, so you've got deep technical understanding and support right from the top.\n\n* We solve real problems for real people that they're happy to pay us real money to solve for them. We go home each day knowing we made a difference in someone's life.\n\n* We have a strong community around us, and cherish our close and mutually respectful relationships with our customers. It feels good knowing the people we’re serving.\n\n* We do things differently from other companies. You'll see. We laugh a lot. We breathe. We care about our people. We support you on your journey.\n\n\n### What we absolutely require:\n\n* You gotta be great at Rails and pretty darn sharp when it comes to React, or at least with Javascript\n\n* You gotta be very smart and very quick at \"getting\" stuff.\n\n* You gotta love creating software and building things. And be really good at it. You build software in your free time as a hobby because you can’t not do it.\n\n* You have to be good at figuring stuff out that none of us have ever done before.\n\n* This is a big project, with lots of pieces. You've got to be good at reading code and quickly figuring out what's going on.\n\n\n### What we could care less about:\n\n* years of experience. You probably started when you were a kid, anyway.\n\n\nA university degree, especially PhD's or degrees in computer science. We're not scientists, we're engineers. (We do have a soft spot for physics majors, tho.)",
      "datePublished": 1666440786103,
      "companyName": "Simplero",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "New York",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["css", "mysql", "html", "ruby on rails", "react.js"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "mfpnYMderotuT",
      "link": "https://jsjobbs.com/javascript-jobs/mfpnYMderotuT-remote-senior-full-stack-engineer-tutored-by-teachers",
      "title": "Remote Senior Full-Stack Engineer",
      "description": "At Tutored by Teachers, we believe that when you put a teacher in front of a student, magic happens. As part of our engineering team, you’ll have the opportunity to shape and build the multi-faceted platform that enables that magic and ultimately amplifies it. Join us on our mission to close the opportunity gap!\n\nFrequently cited statistics show that women and underrepresented racial minorities will only apply to roles if they feel they meet 100% of the qualifications. At TbT, we encourage you to break through that statistic. Roles evolve over time, especially with innovation, and you may be just the person we need in the future. If you are excited by this job description and energized by the work we are doing, but you don't meet every qualification, please apply :)\n\n**As Senior Software Engineer,  you will:**\n* Architect, design and develop new web applications, tools, and distributed systems for the TbT ecosystem in Node, React, Typescript, PostgreSQL, GraphQL, and many others. You will get to work on your deliverable end-to-end, from the UX to the deployment logic.\n* Mentor and support more junior developers in the organization\n* Create, improve and refine workflows and processes for delivering quality software on time and without incurring technical debt\n* Work closely with TbT educators, product managers, support representatives, and account executives to help the business move fast and efficiently through relentless automation.\n\n### Requirements\n* B.S. in Computer Science or similar industry experience\n* 5+ years of software development experience\n* A propensity to drive both yourself and the team to achieve results that delight customers\n* A track record of delivering creative solutions which achieve efficient results\n* An understanding of cloud technologies and how to leverage them to build an exceptional software development organization\n* The ability to mentor and empower other engineers to demonstrate full ownership of educators' and students' problems\n\n### Preferred Qualifications\n* Experience building B2B or B2C SaaS portals or applications\n* Experience in ed-tech and/or a fast-growing early-stage company\n* Strong interest in UI/UX design principles and in-app analytics\n* Familiarity working with and developing data models\n* SQL proficiency\n\n### Benefits\n* 100% healthcare coverage for you and your family\n* Access to 401k to help save for the future\n* Well-rounded wellness benefits include access to free and low-cost mental health resources and support services\n* Fully remote work environment and a flexible schedule\n* Company-owned laptop + home office equipment\n* Annual in-person team retreats\n* 3 weeks of vacation in the first year and an unlimited vacation policy after year 1 to help recharge",
      "datePublished": 1666436618252,
      "companyName": "Tutored by Teachers",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "REMOTE",
      "offersRemote": true,
      "remoteLocations": ["North America"],
      "tags": ["typescript", "node.js", "react.js", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "VyKw7NrekcitS",
      "link": "https://jsjobbs.com/javascript-jobs/VyKw7NrekcitS-software-engineer-security-sticker-mule",
      "title": "Software Engineer - Security",
      "description": "### About Sticker Mule\nSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\n\nThe Security team is responsible for performing penetration tests on our front-end and back-end web services, developing new automated offensive tools and troubleshooting problems.\n\nSee more about our teams here\n\n### We offer\n1. Remote work with flexible schedules\n2. Varied, interesting technical challenges to solve\n3. A fun \"no bullshit\" work environment\n\n### We like you to know\n1.Linux\n2. Kubernetes/Docker\n3. GCP/AWS\n4. Postgres/MySQL\n5. Redis\n6. NextJS/React\n7. NodeJS\n8. GraphQL\n9. Go\n10. Excellent communication skills (English)\n11. Degree in Computer Science or equivalent practical experience\n\n### Challenges\n1. Improve security of our web services\n2. Implement automated tools to reduce security regressions\n3. Perform offensive penetration tests\n\n### Compensation and benefits\n1. Salary: $120,000/year\n2. $20,000 signing bonus\n3. 4 weeks vacation (+ holidays based on your country of residence)",
      "datePublished": 1666435397968,
      "companyName": "Sticker Mule",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "New York, New York",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["kubernetes", "node.js", "react.js", "postgresql", "graphql"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "dKnFlZbuHlaicoS",
      "link": "https://jsjobbs.com/javascript-jobs/dKnFlZbuHlaicoS-backend-javascript-nodejs-developer-remote-saas-m-f-d-socialhub",
      "title": "Backend Javascript / Node.js Developer - Remote/SaaS (m/f/d)",
      "description": "### DOES THIS SOUND LIKE YOU?\n\n* You like writing automated tests so you notice regressions on your code early on\n\n* You love to see your users happy. Therefore you don’t hesitate to help clients if the need arises for solving bugs.\n\n* Using a DVCS like git comes natural to you\n\n* You appreciate constructive criticism and are able to provide such yourself when reviewing others code\n\n* You have a thing for documenting your work because you know your future self will appreciate it\n\n\n### YOUR REQUIREMENTS FOR THE JOB\n\n* At least 3 years working experience in a development team and experience in developing scalable web apps\n\n* Experience in building Node.js based APIs with Express.JS\n\n* Knowledge of common web security best practices (e.g. OWASP 10)\n\n* You are able to work and communicate with your teammates through our core hours (11am to 4pm german timezone)\n\n\n### THESE SKILLS WOULD BE BENEFICAL FOR YOU\n\n* You have experience with technologies like Redis, RabbitMQ and the ELK stack\n\n* Experience with non-relational databases\n\n* Knowledge of mongodb and its query syntax\n\n* You can analyze and resolve performance issues with mongodb queries and indices\n\n* You’ve worked with gitlab and gitlab ci before\n\n* Knowledge of the Social Network API’s e.g. Facebook, Twitter, etc.\n\n* You’ve run your own Web Server in the past and know your way around Linux\n\n\n### WHAT WE HAVE TO OFFER\n\n\n* Company houses 2023: We rent houses worldwide - free of charge for you. Enjoy work and meet your teammates from all over the world. To work or to take a vacation, we leave it up to you!\n\n* Flexible working hours and the possibility to work remotely.\n\n* An enthusiastic and friendly team in a productive working environment.\n\n* Varied and challenging activities in a constantly growing and future-oriented industry.\n\n* Great coaching and development opportunities. \n\nWe have an annual budget for external training courses and conferences. We previously attended GitHub Universe in London and Amsterdam.\n\n* An afternoon each sprint (every 2 weeks) to work on something that interests you. Want to learn a new programming language? That’s fine by us. It doesn't have to be work-related. It’s there to help you expand your skill set and keep the creative juices flowing. \n\n* Always a cold Fritz-Kola in the fridge (if you decide to stop by our office). \n\nJoin us for whole company get-togethers. Our past retreats have been in Belgium, Prague & Spain. Our next one is in Portugal.",
      "datePublished": 1666356756209,
      "companyName": "SocialHub",
      "companyLogo": "",
      "countryName": "Germany",
      "countryAbbreviation": "DE",
      "state": "Ingolstadt, Deutschland",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["expressjs ", "javascript", "node.js"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "eOXfZtelbappotsnU",
      "link": "https://jsjobbs.com/javascript-jobs/eOXfZtelbappotsnU-senior-fullstack-engineer-devtools-unstoppable-domains",
      "title": "Senior Fullstack Engineer, DevTools",
      "description": "### About Us\n\n**Founded: 2018**\n\n* Product: We're bringing decentralized digital identity to the world by issuing Web3 domains on the blockchain.\n\n* Mission: We’re returning power to the people; championing their right to control their own data, govern their own identity and make their own choices.\n\n* Culture: We have a culture built around ownership, autonomy, innovation and learning, including a world-class Crypto Education Program to support people at all stages of their crypto journey.\n\n* Location: We are US-based but we have a 100% Remote and international team.\n\n* Growth: 5x employee growth since 2021. 5x yearly revenue growth since 2019.\n\n* Funding: In July 2022, Unstoppable announced $65 million in Series A funding at a $1 billion valuation 🦄. We are backed by Pantera Capital, Alchemy Ventures, OKG Investments, Polygon, Tim Draper, Coinbase Ventures and Boost VC.\n\n* Team: 150+ employees in 20+ different countries, including a prestigious leadership team that has a history of building successful unicorn startups and leading tech giants.\n\nClick here to learn more about our team, company, culture, and what you can expect when applying at Unstoppable Domains.\n\n### The Role\n\nWe’re seeking a Senior Fullstack Engineer to enhance the developer experience for partners who integrate with Unstoppable Domains. You will work closely with the experienced engineers on the team and other leaders across the company as we seek to radically transform how 3 billion+ internet users live and interact on the decentralized Web.\n\n### Responsibilities\n* Be part of a small team with a large amount of ownership and autonomy\n* Ship high-quality solutions in a fast-paced environment where requirements can change quickly\n* Write, test, and deploy code on our public-facing APIs and libraries\n* Coordinate with partners and other teams to ensure integrations are functioning\n\n**Must Have**\n\n### Requirements:\n* 5+ years of software development experience\n* Self-motivation and a strong sense of ownership\n* Strong knowledge of Javascript/Typescript and Node.js\n* Experience with databases (we use PostgresSQL)\n* Passionate about user/developer experience\n* Fluent in English\n* Nice To Have\n* Open-source APIs and libraries development experience\n* Familiarity with Java, Swift and Go programming languages\n* Fundamental knowledge of security\n* Experience with blockchain technologies development\n* Proficiency with React, Redux, SSR, HTML/CSS\n\n**Our Tech Stack**\n\n* TypeScript, Java, Swift, Go, PostgreSQL, React\n\n### The Engineering Team\n\nOur Engineering teams consist of five major entities: Ecommerce, Developer Tools, Login, Mobile and Registry with 3 to 15 developers each. They are cross-functional, highly autonomous teams that work in direct cooperation with Product Managers, UX Designers, and Go-To-Market teams. 90% of our team is currently made up of senior engineers.\n\n### What We Offer\n* 100% employer-paid medical, dental and vision insurance\n* 401(k) with 4% company match (after 1 year)\n* Equity\n* 100% remote-work environment\n* Monthly co-working space stipend\n* Home office budget\n* 15 days of vacation time, increased to 20 days after 1 year\n* 7 health days to tend to health and wellness needs for themselves or dependents\n* 80 hours of supplemental COVID-19 recovery time\n* National holidays\n* Disability insurance\n* Life Insurance\n* Employee Assistance Program\n* Travel Assistance Program\n \nOur privacy policy explains how we collect and process your data in accordance with applicable data protection laws.\n\nUnstoppable Domains is committed to fostering a diverse and inclusive workplace. We provide equal employment opportunities for all team members and applicants, regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, sexual orientation, or any other legally protected characteristic.\n\nTo learn more about Unstoppable Domains, our product and plans for 2022, please check out the Unstoppable Domains Podcast",
      "datePublished": 1666356275508,
      "companyName": "Unstoppable Domains",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["postgresql", "javascript", "java", "node.js", "react.js"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "A18ArTeredilaV",
      "link": "https://jsjobbs.com/javascript-jobs/A18ArTeredilaV-senior-software-developer-back-end-nodejs-validere",
      "title": "Senior Software Developer, Back End (Node.js)",
      "description": "Validere is a leading data and analytics SaaS provider for the energy Industry. We're on a mission to digitally transform the world's largest supply chain to be more commercially and environmentally efficient. Our product enables energy companies to aggregate their many disparate data sources into a single tool - allowing them to better understand their operations and emissions. Over 40 leading energy companies have partnered with Validere to identify new, hidden sources of value across their business. Our unique datasets and experts across data science, physical science, and oil and gas provide our clients a company-wide value engine that boosts commercial margins, reduces operational costs and risks, and ensures meaningful environmental progress.\n\n### Who you are:\n\n* To support our rapid growth, we are looking for Senior Software Developers with expertise in software architectures and design principles, database management, DevOps, and/or embedded systems. Above all, we’re looking for someone who is driven and excited about the positive impact technology can have on business.\n\n### Let's give you a purpose:\n\n* Design, build, and maintain reliable code to develop high throughput, scalable applications\n* Design and develop new cutting edge features in our various product platforms\n* Collaborate with the Product team to plan and coordinate feasibility and delivery of future work\n* Participate in code reviews to push for high quality and coding standards\n* Mentor and coach fellow team members\n\n### What you'll bring along:\n\n* Bachelor’s degree in Software Engineering, Computer Science or extensive practical experience with software development\n* 5+ years of professional experience, preferably in a high growth, fast-paced technology start up\n* Deep understanding and familiarity with Node.js\n* Experience with relational databases (we use Postgres)\n* Strong sense of ownership and accountability\n\n### Nice to have\n\n* Experience with React.js\n* Experience with AWS\n* Experience with Data Analytics products \n\n### We love it here, you will too:\n\n* Competitive compensation\n* Comprehensive health benefits\n* Stock options (at Validere, we're all owners)\n* RRSP/401(k) matching programs\n* Flexible working arrangements\n* Professional development budget to master your craft\n* Generous time-off with parental/family leave\n* Quarterly Employee Wellbeing Days and No Meeting Friday Afternoons\n* An inclusive, ego-free environment where diversity of people and thought is valued\n* Opportunity to impact the trajectory of a fast growing tech company\n\n### Our shared values:\n\n* Deliver (the highest) value\n* Remove friction\n* Make it more scalable everyday\n* Be fair and transparent\n* Stay well & safe\n\nValidere is an equal employment opportunity employer. We welcome and encourage applications from everyone regardless of race, colour, religion, gender, sexual orientation, age, or disability status. Accommodations are available on request for candidates taking part in all aspects of the interview process and beyond. We are committed to providing an inclusive, open, and diverse work environment.",
      "datePublished": 1666355077921,
      "companyName": "Validere",
      "companyLogo": "",
      "countryName": "Canada",
      "countryAbbreviation": "CA",
      "state": "Calgary",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["react.js", "node.js", "aws"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "KicwNztendeM",
      "link": "https://jsjobbs.com/javascript-jobs/KicwNztendeM-senior-front-end-engineer-for-stack-overflow-for-doctors-mednet",
      "title": "Senior Front End Engineer For Stack Overflow For Doctors",
      "description": "### Company\nMednet is StackOverflow for doctors. We are a question and answer platform where doctors can get questions answered by leading practitioners in their field. This solves a huge problem in medicine: getting every doctor the best possible information on how to treat their patients.\n\nWe started with oncology, and are now the most used digital platform in the field: over 80% of oncologists use Mednet. Our business model is based on teaching doctors about newly developed drugs that can improve their patients' outcomes. Our users say we are the best online resource to get help with difficult cases and our revenue is growing at 3x YoY.\n\n### Our Values\n* Doctors first - Any decision we make must start by asking whether we are helping doctors make better decisions for their patients\n* Have a can-do attitude - No work is below any member of the team. We all pitch in to help achieve our mission\n* Take ownership - Develop your strategy, execute on it, iterate until you get the results that you want\n* Treat each other right - Treat your colleagues with respect, kindness, professionalism and integrity\n**Job Description**\nWe’re planning to scale Mednet to 8 new medical fields this year, and building products to drive growth and engagement will play a key part in enabling that goal. As a front end engineer, you will work closely with our CEO and engineering team. You will be responsible for building front end across 3 products, our existing doctor facing website, our internal community management platform and our client facing interface. The client facing interface is a completely new platform that will have to be built from scratch.\n\n### Job Requirements\n* You are passionate about your work having a social impact\n* Experience building and architecting front end systems\n* Experience in React\n* Ability to own standalone mission critical services.\n* 5-10 years of engineering experience (at least 2 years at a fast growing startup preferred)\n* Additional experience (preferred but not required)\n* UX/UI experience\n* Node JS\n* Understanding of medical terminology and the healthcare system\n* Experience or familiarity with The Medical Subject Headings (MeSH)",
      "datePublished": 1666353734348,
      "companyName": "Mednet",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "New York",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["react.js", "node.js", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "PcgcbseuV",
      "link": "https://jsjobbs.com/javascript-jobs/PcgcbseuV-senior-product-manager-vue-storefront",
      "title": "Senior Product Manager",
      "description": "OK, so let's start with a few words about Vue Storefront.\n\nVue Storefront is a Frontend Platform for Headless Commerce, which was built with an open-source mindset and the trust of a global community. It is the result of our effort to provide developers with modern and forward-thinking technical solutions crafted to meet common eCommerce industry challenges. \n\nVue Storefront started in 2017 as a bottom-down initiative from Divante agency developers who were looking for ways to make things faster, easier, and more effective. The available solutions didn’t meet their expectations so they created their own.\n\nToday, Vue Storefront is not only the biggest and the fastest growing Frontend for eCommerce, it’s a whole ecosystem of frontend services that can work together or independently. Each of the services addresses a key component of your development cycle while building eCommerce storefronts – from Build to Launch. \n\n* Salary: 18.000 - 23.000 PLN net + VAT (B2B)\n* Location: Remote, Europe\n\n### What will you be doing in this role?\n\n* Designing, developing and managing activities from product definition & planning to production and release\n* Providing input for pricing strategy of product\n* Identifying business risks for product development\n* Analyzing & designing of product capabilities & features (Use Cases, UI Mockups)\n* Managing prioritization and trade-offs between customer experience, business impact, performance, and post-launch support\n* Positioning the product effectively within and out of the organization\n\n### What do we expect you to have?\n\n* Over 4 years of strong background in product management\n* Deep understanding of product management processes\n* Experience in managing a product throughout its lifecycle\n* A track record of managing B2B/SaaS products, ideally in the eCommerce area\n* Excellent communication skills both in a team and customer relations\n* Fluency in English language 'How we can make this better' attitude in problem solving 'Growing as a human being' approach\n\n### What can you expect?\n\n* Senior and experienced team\n* Budget and tools for your skills Growth\n* Fully Remote work with flexible working hours\n* Values-driven culture, friendly and supportive work environment\n* Contract type tailored to your need\n* Engagement: it’s full-time engagement in every case\n* Ability to regularly attend conferences and community events, both as participant and contributor\n* Flat organizational structure: it helps to focus on what’s essential - have no barriers in communication, no Corpo-language, no going things around, no need to do things differently than most smartly and efficiently.\n* Relations: VSF values healthy relations and spends time together - e.g. two weeks with your teammates and families on Tenerife and team events?\n* Benefits: contract type depending on your decision, Medicover medical care package, access to the pool of courses, time to time workation, flexible working hours, working from wherever you want.\n* Join us if you feel that it's time for you to join VSF’s extraordinarily enthusiastic and successful team!",
      "datePublished": 1666338964865,
      "companyName": "Vue Storefront",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["vue.js", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "ZFCG3LytinU",
      "link": "https://jsjobbs.com/javascript-jobs/ZFCG3LytinU-senior-full-stack-developer-unity",
      "title": "Senior Full-Stack Developer",
      "description": "### The opportunity\n\nWe are seeking a senior full-stack developer to join us in building our decoupled CMS architecture for use across the Unity websites.\n\n* As a member of this team you will build our new content editing suite and shape the platform on which it runs. Stability, security, and robustness of code are key requirements, as well as a sense for good design and user experience.\n\n### About You\n\n\n* You have experience with CMS and want to take your front-end and back-end development skills to the next level? We are looking for dedicated developers who can help us develop the systems our company will rely on to build and edit content for our websites.\n\n* Do you want to join a skilled team, in a growing company, that is already a market leader in an exciting industry? This is an opportunity to be a key piece of how we connect with our users, enabling more people to make more outstanding things.\n\n### What You’ll Be Doing\n\n* Developing our new Content Management System for our main company websites, working closely with both our internal users, product partners and architects.\n* Adding to our React.js/NextJS front-end stack and building a new back-end based on Firebase, cloud functions and other innovative techniques.\n* Learning on the fly; we don't expect you to be an expert on all things but you should be keen to pick up new things.\n\n### What We’re Looking For\n\n* Development experience using Javascript based technologies, particularly React.js, NextJS and Typescript\n* Being proficient in both front-end architectures and back-end systems supporting them\n* Good fundamental coding skill that we can help you build upon\n\n### You might also have\n* Familiarity with cloud-hosting technologies, particularly GCP and Firebase\n* Experience with NextJS, Storybook and Tailwind CSS\n* Knowledge of headless CMS systems such as Contentful, Stratpi or Sanity.io\n\n### Life at Unity\n\nUnity (NYSE: U) is the world’s leading platform for creating and operating real-time 3D (RT3D) content. Creators, ranging from game developers to artists, architects, automotive designers, filmmakers, and others, use Unity to make their imaginations come to life. Unity’s platform provides a comprehensive set of software solutions to create, run and monetize interactive, real-time 2D and 3D content for mobile phones, tablets, PCs, consoles, and augmented and virtual reality devices.\n\nIn the fourth quarter of 2021, Unity had, on average, 3.9 billion monthly active end users who consumed content created or operated with its solutions. The applications developed by these creators were downloaded, on average, five billion times per month in 2021. For more information, please visit www.unity.com.\n\nUnity is a proud equal opportunity employer. We are committed to fostering an inclusive, innovative environment and celebrate our employees across age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law. Our differences are strengths that enable us to support the growing and evolving needs of our customers, partners, and collaborators. If there are preparations or accommodations we can make to help ensure you have a comfortable and positive interview experience, please let us know.\n\nHeadhunters and recruitment agencies may not submit resumes/CVs through this website or directly to managers. Unity does not accept unsolicited headhunter and agency resumes. Unity will not pay fees to any third-party agency or company that does not have a signed agreement with Unity.",
      "datePublished": 1666268261924,
      "companyName": "Unity",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["nextjs", "react.js", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "Bh1EMOthgirpU",
      "link": "https://jsjobbs.com/javascript-jobs/Bh1EMOthgirpU-fullstack-engineer-upright-labs",
      "title": "Fullstack Engineer",
      "description": "Upright Labs is looking for fullstack engineers who want to work up and down the stack.\n\n### About\n\nUpright Labs builds multichannel e-commerce software for retailers. We make it really easy for secondhand retailers to manage inventory and sell online, everywhere. Our software processes hundreds of thousands items each month and has helped retailers sell millions in inventory.\n\n\nWe work with secondhand goods retailers including Goodwill and Salvation Army. Our software powers their ecommerce operations and your code will directly impact their success.\n\n\n**Our stack is Ruby on Rails on the backend with React.js and TypeScript on the frontend, backed by Postgres and Redis databases. We run everything on AWS and Heroku, logging with LogDNA, CI with Github Actions, error tracking with Sentry, monitoring with Datadog, and source code on Github.**\n\n\n* You'll help our engineering team grow by helping us make foundational decisions in our product and technical directions. If you like to work on small teams with lots of autonomy and love watching your code make a positive impact, then you'll be a great fit for Upright.\nAbout the Product Team\n\n* We are a highly motivated group of professionals that are very passionate about supporting our customers. Each team member certainly has their own proficiencies they bring to the table, but we are also all very happy to take on any dynamic responsibilities that come up as a startup. We are comfortable jumping in to help solve a problem, no matter what our title is. The success of our customers is our success at the end of the day, so we do everything we can to empower them!\n\n### About You\n\n* You're a hacker. You love to code, read Hacker News, and constantly push yourself to try new web technologies.\n* You’re well rounded, you care deeply about building good software, but also about maximizing business impact.\n* You're a go-getter, want to expand your skills, and dive deep into code to figure out and tackle hard problems.\n* You're a self-starter who wants to push out code on day 1.\n* You have strong opinions, weakly held. You're not afraid to stand up for what you believe in but are empathetic and open to change.\n* You operate well in a collaborative, feedback-driven environment\n* Have 3+ years experience working on larger-scale web applications.\n\n### What You'll do\n\n* Deploy code on your first day.\n* Dive into every corner of our stack, drive decision-making, and own new features.\n* Work on our Rails backend and React frontend building out new features and improvements.\n* Talk to customers and contribute in product direction\n* Help guide and grow Upright Labs into the best ecommerce software for retailers.\n\n### Why Upright\n\n* 100% remote forever\n* Competitive compensation\n* Health/dental/vision insurance\n* 401k match\n* Unlimited vacation policy\n* Annual off-sites\n* Office equipment stipend to get your home office set up the way you like it\n* Hot-desk stipend if you prefer working out of co-working spaces\n* Continuing education budget so you can keep learning outside of your day to day job\n* Work with an exciting and growing company with lots of interesting technical problems\n\n### How to apply\n\n👉 To apply please submit your application via this form: https://form.jotform.com/222006974897164. 👈\n\nPlease note, candidates who do not submit the application form will not be considered. We are accepting applications on a rolling basis. We are committed to following up with all candidates and appreciate your interest!\n\nUpright Labs is a strong and flexible team because of the diverse backgrounds of our staff. This includes professional background, subject matter expertise, culture, race/ethnicity, sexual orientation, gender identity and expression, language, hobbies, etc. We strongly encourage women, minorities, and people from underrepresented backgrounds to apply. Your skills are needed here.",
      "datePublished": 1666267257581,
      "companyName": "Upright Labs",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Washington, DC",
      "offersRemote": true,
      "remoteLocations": ["North America"],
      "tags": ["postgresql", "react.js", "redis", "javascript", "typescript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "p7H2aFi2G",
      "link": "https://jsjobbs.com/javascript-jobs/p7H2aFi2G-principal-react-native-developer-fully-remote-us-only-g2i-inc",
      "title": "Principal React Native Developer (Fully Remote, US only)",
      "description": "**\"G2i totally changed my life. My quality of life is way, way better. I get less stressed. I get less sick. I have more hours in my day to give attention to my family. I'm really thankful for working with them.” - Tiago Souto**\n\nTiago’s story is proof that vacancies you see at G2i are filled with healthy and happy devs – which means this could not only be your next job, but the one after that as well.\n\n### You probably want to know what’s involved. \n\n* If you’ve been a Senior React Native Developer for a while, you know what it takes to succeed at the next step. It’s being able to make strategic tech decisions as you ship an awesome product. Keep your team happy. Delight users. All thanks to your problem solving skills, clear documentation, AND top notch communications. Bonus points if you’ve done all of that before with native iOS or Android technologies.\n\n* Bring technical leadership and domain knowledge that will make you invaluable. You’ll be the architect for an award winning mobile application so we expect not just technical proficiency but also management skills as you mentor a team in analysis and development tasks. You’ll ideate, develop and maintain a high-impact application that’s helping millions of people secure their financial futures. If that doesn’t check the box for a rewarding career then go ahead and tell us what will. \n\n* You’ll work 100% remotely with a renowned US financial services company on a direct hire basis. But this role is only available to applicants already based in the US. Direct hire means you’ll be eligible for a slew of employee benefits. There’s a ton of them but the ones we’ve been most impressed by are: upto 5% 401k matching, 25 days PTO on top of a generous family/parental leave plan, discounted Employee Stock Purchase Plan and an enviable healthcare package.\n\nIf you’re a stickler for details, you might want to know that you’ll be working with technologies like React, React Native, Java, Android/iOS, GraphQL and Apollo Client.\n\n* G2i devs are never alone. There’s a learning curve to joining a new company but we’ve got a really tight community of 800+ engineers on Slack that you can lean on as you dive in. You’ll also have a direct line to our Developer Success Team (shoutout to Kevin!) whose job is to have your back.\n\n* G2i is the first hiring platform that focuses on developer health, which explains why we have plenty of opportunities for you to explore. We've seen burnout all too often in tech and we are on a mission to push back against it. We believe in maintaining a healthy work-life balance, and act on those beliefs by:\n\n* working only with companies who share in our mission\n* advocating for devs in the G2i community with clients\n* developing NFL-like support for burnout recovery, and\n* launching the Developer Health Fund. \n\nNot to mention, we're literally writing the book on developer burnout prevention with our Restful Work OS.\n\nJust click “Apply”. We appreciate that your resume may not be up to date so just share a copy of your LinkedIn profile. You can then tell us everything else we need to know in a chat with the recruiting team and a one-off coding challenge.\n\nG2i is an equal opportunity employer. We’re dedicated to building a team where diversity in both ideas and identities is not only welcomed, but encouraged. We do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, age, disability, marital status, citizenship, national origin, genetic information, or any other characteristic protected by law.\n\nIf you are part of an underrepresented group in tech that is considering applying, but you have any reservations about doing so, please email our Director of Talent Acquisition, Eva@g2i.co, and let us know how we can be more welcoming to you",
      "datePublished": 1666266515565,
      "companyName": "G2i Inc.",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Delray Beach, FL",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["java", "react.js", "react native", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "VH5WRzxiferP",
      "link": "https://jsjobbs.com/javascript-jobs/VH5WRzxiferP-remote-founding-engineer-prefix",
      "title": "Remote Founding Engineer",
      "description": "### Howdy, we’re Prefix 👋🏾\n\n\nWe're people against toil. Our goal is to help restaurants operate more effectively and efficiently. Repair and maintenance operations are a major burden for restaurants of all sizes, so we’re building software to save them time and money, freeing them to focus on what matters: making delicious food.\n\n\nWe’re building a company where we are proud to work. Prefix is remote-first with a flexible schedule. We strive to be clear in our communication and over-communicate by default. It's early stage, so you’ll have the opportunity to shape not only the product, but the company, how we work together, and how our business develops. We’re seeking personalities, experiences, and opinions to foster a diverse and inclusive workplace.\n\n\n### Team\n\n\nThe cofounder duo are experienced startup people managers, half product-focused and half engineering-focused, and allergic to internal politics. With our venture pre-seed funding, we’re hiring our founding engineering team with runway through mid-2023.\n\n\n### The Opportunity\n\n\nAs a founding software engineer, you’ll help to build the core, customer facing product from zero to MVP to paying customers. You’ll be part of evaluating and selecting our infrastructure, frameworks, and development productivity stack. You will collaborate with product and design to drive release of major features and help process the first-hand feedback from users. You will also instantiate and maintain standards, patterns, and best practices for well-tested, maintainable code both as an contributor and code reviewer. You’ll pair program with colleagues several hours each week to learn, to mentor, to unblock, and to have fun. You’ll have visibility and input into the direction of the product and the business. You’ll have a front row seat to building a SaaS company.\n\n\n### Product stack + tech stack + process\n\n\nEspecially for remote development, tools, process, and an evolving approach matter. We’ve been using Twist and Loom for async communication, Meet for meetings, Notion and Figma for documentation, and are still evaluating project management tools (if you have opinions about Height, Linear, Constructor, Jira, Asana, Notion, et al, give us a shout!). Tech stack includes git(hub), typescript, react, and postgres. We’re eager to adopt tools that reduce engineer toil, increase speed without sacrificing quality, have a scaling story or exit path, and make engineers smile – tools like tRPC, cypress, and railway seem well suited. We’re working in two week cycles with planning and retrospectives on Friday with daily async standup to stay on the same page. Our only synchronous expectations are reasonable availability for weekly 1:1s, pairing, and planning/design meetings 11am-5pm Eastern, otherwise, we want to empower you to work on your schedule.\n\n\n### Desired skills\n\n* 3+ years of experience as a software engineer in tech companies with track record of thoughtful software delivery\n* Experience with front-end design or full-stack product development or senior-level backend experience with a demonstrated ability to learn new skills\n* Clear, empathetic, thoughtful written communication, always assumes good intent\n* Exposure to some flavor of agile development in a remote context\n\n### Within 1 month, you will\n\n* Collaborate with team members in weekly pair-programming sessions\n* Contribute to improved DevOps, CI/CD, or development tooling and infrastructure\n* Discuss your career growth goals and give feedback in weekly 1:1 with manager\n* Teach other members of the team through design feedback, code review, and pairing\n\n### Within 3 months, you’ll\n\n* Evaluate and select new tools, frameworks, or libraries used in development and production\n* Plan, design, build, release, and support several major feature releases\n* Grow comfortable contributing and reviewing code across most of the tech stack\n* Provide feedback on culture, values, or processes that are lacking\n* Connect with your colleagues via weekly 1:1 coffee chats\n* Have balanced decisions on tech debt against customer impact\n\n### Within 9 months, you’ll\n* \n* Produce an MVP that customers like (because they helped build it)\n* Own one or more major feature areas of the product\n* Have taken on-call shifts to diagnose and resolve production issues\n* Perform root cause analysis for a tech, process, product failure to prevented recurrence\n* Learn new techniques or tools to accomplish technical and business goals both independently and from teammates\n* Identify, prioritize, and improve areas of code base or infrastructure in need\n\n### Benefits\n\n* Competitive salary and equity: $155,000-$175,000 and 0.8%-1.25% equity. We aim to pay better than 3 out of 4 positions at our peers.\n\n* Remote First – work anywhere you want. We require reasonable availability 11am-6pm Eastern for weekly 1:1s, pair-programming, and design/planning/retrospective meetings\n\n* Free gigabit internet – we think this is essential, but it can be pricey, so we’ll cover it\n\n* WFH office budget – Get the computer, desk, chair, headphones, or whatever else you need to work from home comfortably\n\n* 4weeks vacation – time off is important, we’ll encourage you use it all\n\n* Standard benefit stuff – 100% individual healthcare coverage and 401(k) options",
      "datePublished": 1666266088265,
      "companyName": "Prefix",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "New York",
      "offersRemote": true,
      "remoteLocations": ["North America"],
      "tags": ["react.js", "postgresql", "git", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "S5YOEzredliuBnoitaN",
      "link": "https://jsjobbs.com/javascript-jobs/S5YOEzredliuBnoitaN-senior-software-engineer-nationbuilder",
      "title": "Senior Software Engineer",
      "description": "At NationBuilder we create software for leaders. We work with political candidates and parties, nonprofit organizations, community organizers, and anyone else trying to make something happen in the world. Our customers come in all shapes and sizes, from small town organizers trying to win their school board election, to the largest political parties, candidates, and NGOs in the world. To learn more about NationBuilder, read about our mission and beliefs.\n\n* We believe the best products are built by teams rich in diversity and aligned in mission and values. That means creating an authentic culture where diversity thrives everyday. It means building a team where different perspectives are valued through real listening, and assumptions are challenged through healthy and necessary conflict. It means building a team diverse across race and gender.  It means constantly striving to build the best and to be the best. \n\n* Our engineering team dedicates itself to continuous learning and improvement. We built a process that is optimized for rapid, agile development; deploying to production many times a day. To discover the correct solution; we start with a minimum viable product and iterate using team and stakeholder feedback; so that the people, product, and process improve together.\n\n* The role of Senior Software Engineer is to build and maintain the software powering NationBuilder.  You contribute to the effectiveness of the team through constant collaboration, efficient use of available resources, and writing software that is easy to reason about and modify in the future. You think critically to find the best solutions, technologies, and processes. You are capable of implementing significant portions of code and investigating extremely complex issues, while following standards of quality for software, testing, and documentation. You break up small to medium size projects into milestones and execute them to completion, anticipating and resolving problems that arise.\n\n### You:\n* are always interested in learning new things.\n* get excited when you have the chance to pair.\n* practice test-driven development and judicious refactoring.\n* enjoy being responsive to customer feedback.\n* are a pragmatic problem solver, knowing how to find the middle ground between “perfect, but takes forever to code” and “fixes it now, but nobody will ever be able to understand what I did.”\n* clearly communicate about technical solutions with both engineering and non-engineering stakeholders.\n* work well in small teams with a clear mission.\n* have the insight to know what’s important and the dedication to get it done.\n* Have at least 3-5 years of professional development experience.\n\n### Skills required:\n* The ideal candidate is enthusiastic about working with Ruby on Rails, has a strong technical background, and professional experience with Rails. We value the willingness to learn our technologies and our environment. An open and disciplined approach to your work is as important to us as years of experience with any of the technologies in our stack. \n\n**We use Ruby, Rails, PostgreSQL, MongoDB, Redis, HTML/CSS/SCSS, and JavaScript (React/Redux/Bootstrap).**\n\nNationBuilder is an equal opportunity employer and we value inclusion. We are committed to finding talent that is not determined on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. If you are someone who is in search of a place to thrive and grow, we really want to hear from you!\n\nTo apply, tell us why you're a good fit for the job in 280 characters or less (like a tweet, but you don't have to actually tweet it)!! Include contact details, resume, that sort of thing; sites you’ve worked on recently; Github account (or other online code) if you have it.",
      "datePublished": 1666248174907,
      "companyName": "NationBuilder",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "REMOTE",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": [
        "ruby on rails",
        "javascript",
        "react-redux",
        "redis",
        "mongodb"
      ],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "huAZwnsthgiSahplA",
      "link": "https://jsjobbs.com/javascript-jobs/huAZwnsthgiSahplA-remote-engineering-manager-remote-us-alphasights",
      "title": "Remote Engineering Manager (Remote) – US",
      "description": "This position is remote friendly. You will have the option to opt into one of the following work environments: \n* In-office: New York, NY\n* Remote: Only if you have/will have a permanent address in NY, NJ, PA, CT, NC, GA, FL, TX\n\nAlphaSights is the global leader in knowledge on-demand. We connect investment and business leaders with a dynamic network of industry professionals whose informed perspectives help our clients make superior investment and business decisions. With 1200+ employees and nine offices across the US, Europe, Middle East, and Asia, AlphaSights regularly ranks as one of the fastest-growing companies in the world. Learn more at alphasights.com.\n\nWe’ve made terrific progress working in this new space, but there is still an incredible amount of work to do. We’ve only just scratched the surface on how we can apply technology to this problem.\n\nAlphaSights' Engineering Managers are the technical team leaders that excel at unlocking their team’s potential for high quality delivery.  They manage both the technical and the people side of their teams; being both a career mentor as well as a technical mentor for their developers.  They spend a majority of their time ensuring the technical excellence of their team, unblocking their team for maximum delivery, and communicating the team’s needs and progress to the rest of the organization.  As an engineering manager you are expected to be able to write and optimize code, as well as ensure that your developers can do the same. You'll work closely with a variety of people in the business to arrive at the best solution, immediately see the impact of your work, and get feedback directly from users.\n\nWe are looking for experienced managers who are interested in running (and building) technical teams and holding them accountable to an incredibly high standard.  You should be comfortable working across multiple languages, be excited to learn new technologies, and experienced providing technical mentorship to your teams.\n\n**You will:**\n* Manage a team of software engineers, including task planning and code reviews\n* Technically own (and typically build) large areas of our product and service ecosystem\n* Work with Product Owners to flesh out business requirements and ensure that the team is solving the right problems to help the business\n* Ensure that the team adheres to high standards and practices sustainable engineering\n* Help your team grow from both a technical and career perspective.\n* Follow an agile methodology for rapid, nimble delivery.\n\n**You might be a fit if you:**\n* Have at least 5 years of professional development experience, and have at least 2 years of management experience \n* Enjoy mentoring other team members, including code reviews and tech talks\n* Can balance deep work with cross team collaboration\n* Enjoy writing code in a variety of languages\n* Constantly learn from and mentor other engineers\n\nDon't worry if your experience or background doesn't match all of these areas, we believe a broad spectrum of experience provides great perspective on solving problems in new and innovative ways and we’d love to hear from you. \n\n**You might lead teams that:**\n* Build tools to schedule multi-party communication with heavy constraints\n* Automate the detection and mitigation of risk in real-time\n* Tackle the challenges associated with Information Retrieval including building recommendation engines, auto-completion, and data categorization\n* Improve our internal and client facing user interfaces\n* Improve and evolve our core infrastructure to continue to reduce developer friction for deployment\n* Optimize and scaling our overall platform architecture\n\n**Who you would work with:**\n* You would join a dynamic, multinational, and diverse team who enjoy solving interesting problems in a collaborative environment\n* We have self-taught engineers as well as graduates from top Computer Science and Engineering schools\n* Your co-workers will include motivated recent graduates as well as experienced industry leaders from companies such as Google and Amazon\n\nFind out more: http://engineering.alphasights.com\n\n### Compensation and benefits: \n* Average total compensation ranges from $170k – 195k\n* 20 vacation days, 10 company holidays & business closure during winter holiday week\n* Coverage for up to 90% of your medical premiums and 75% of your dental and vision insurance premiums\n* 401(k) match – 4% of your total compensation matched dollar-for-dollar\n* Option to work remotely or in our New York office",
      "datePublished": 1666247141324,
      "companyName": "AlphaSights",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "New York",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "s4zEJQyelraB",
      "link": "https://jsjobbs.com/javascript-jobs/s4zEJQyelraB-senior-full-stack-engineer-toronto-hub-remote-barley",
      "title": "Senior Full Stack Engineer (Toronto Hub - Remote)",
      "description": "### About Barley\n\nCompensation accounts for up to 70% of an organization’s total operating costs, yet the processes and tools used to determine who gets paid what, why, and how is still painfully convoluted and manual. How is this possible? Believe it or not, most companies are still using a dizzying amount of spreadsheets that ultimately leaves leadership guessing and the employees puzzled or worse yet, unfairly compensated.\n\nBarley is a venture-backed startup focused on building solutions for a vast array of compensation challenges (from managing salary bands to conducting pay equity analysis). With Barley’s Compensation Management platform, our goal is to empower organizations to make better pay decisions.\n\nRemote-First Across Two Hiring Hubs: Barley is a remote-first company that supports a flexible approach to work. Our team is co-located across two hiring hubs (Toronto and Vancouver). While we all predominately work remotely (i.e. work from home) , we offer dedicated offices in both Toronto and Vancouver so that our team can collaborate and come together in-person, as desired.\n\n### What You’ll Be Doing\n\n* Rapidly solving technical challenges and building features as we work towards launching the initial version of the Barley platform\n* Collaborating closely with engineering, product, and design team members in an agile environment (strong understanding of Scrum/Kanban)\n* Building with a strong orientation towards data schemas, analytics, and database design\n* Developing and managing integrations & APIs\n* Taking initiative to understand “the why” of what you’re building, the business context, and user problems to propose improvements, eliminate gaps, and reduce risk\n* Choosing between taking quick shortcuts to find product/market fit vs. build deeper scalable product in the early days of a startup\n* Implementing product with strong security and data privacy top of mind\n\n### Experience & Skills You'll Bring to the Team\n\n* Professional experience shipping cloud-based software products to market\n* Building microservices, in a multi-tenant SaaS environment, using Node.js, GraphQL, Hasura, PostgreSQL\n* Experience with modern web application development, using JavaScript (or TypeScript), ReactJS, GraphQL, Vite, Hasura (similar to Apollo)\n* Experience with schema design, advanced SQL queries and relational databases such as PostgreSQL\n* Experience with cloud and serverless infrastructure (GCP, AWS or Azure)\n* Relentless curiosity to learn new things and receptive to feedback\n* Hands-on experience with microservices, containerization (Docker), and CI/CD (Github Actions) is a PLUS\n* Developing monitoring and observability strategies a PLUS\n* University degree in Computer Engineering/Science, or equivalent is a PLUS\n* Having experience building a product from the ground up and have launched new products to market is a PLUS\n* Experience in business-to-business (B2B) SaaS software is a PLUS\n* Haven’t worked with some of our specific technologies? No problem, a deep experience with web technologies and willingness to learn our tech stack goes a long way\n\n### Why You’ll Love Working at Barley\n\n* As an early member of the Barley team, you’ll play a key role in setting the stage for future employees\n* You’ll help push forward an important mission of driving more rational and equitable pay\n* You’ll have a piece of the pie - every Barley employee participates in our stock option plan\n* A generous vacation policy and full health and benefits coverage that kick in on your first day\n* An annual learning and development allowance to invest in your professional growth\n* You'll be equipped with a MacBook, monitor, and accessories (plus a Workspace Allowance)\n* We're a remote-first company, but also have offices in Toronto and Vancouver for the option to collaborate in-person\n* We host fun company-sponsored events (e.g. team dinners) as well as multi-day off sites (like our annual retreat that was last hosted in Whistler, BC)\n\n### Our Interview Process\n\n* Screening Interview: This is a 30 minute phone call or Zoom meeting where we'll share more about the role, learn about your background / experience (and alignment to the position), and answer any questions you may have\n* Skills Interview: This is a 1.5 hour Zoom meeting where we will assess your technical skills. It includes a live coding exercise as well as some technical experience questions. No take home exercises or homework\n* Experience Interview: This is a 1.5 hour Zoom meeting where we will conduct a chronological walkthrough of your career journey. This is where we learn more about your successes, challenges, major inflection points that brought you to where you are today.\n\n### Compensation\n\nAt Barley, we believe that more transparent compensation practices support more equitable pay for all. Depending on your experience/seniority, this role's compensation is:\n\n* Base Salary: $130,000 - $175,000\n* Stock Options: 0.1% - 0.4%\n\nBarley is an equal opportunity employer that is committed to building an equitable workplace that is diverse and inclusive. We actively encourage candidates from all backgrounds to consider us as a potential employer. If you require any accommodation at any point during our virtual interview process, please email us at work@barley.io.",
      "datePublished": 1666191951660,
      "companyName": "Barley",
      "companyLogo": "",
      "countryName": "Canada",
      "countryAbbreviation": "CA",
      "state": "Toronto",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["typescript", "node.js", "react.js", "graphql", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "yqKA62MBI",
      "link": "https://jsjobbs.com/javascript-jobs/yqKA62MBI-front-end-senior-full-stack-developer-ibm",
      "title": "Front End Senior Full Stack Developer",
      "description": "### Introduction\n\nAs an Application Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\n### Your Role and Responsibilities\n\nAs a Front end Full Stack Developer, you will lead IBM into the future by translating system requirements into the design and development of customized systems in an agile environment. The success of IBM is in your hands as you transform vital business needs into code and drive innovation. Your work will power IBM and its clients globally, collaborating and integrating code into enterprise systems. You will have access to the latest education, tools and technology, and a limitless career path with the world’s technology leader. Come to IBM and make a global impact!\n\nIBM has an immediate opportunity for an experienced, forward thinking Application Developer with a passion for growth and innovation.\n\nYou are…\n\n* A curious and fast learner;\n* Able to translate business needs to technical requirements and implementation;\n* A team player interested to be part of a senior team of talented developers;\n* Open to learn new software development processes, like test-driven developing or domain-driven design, etc.\n* Motivated by challenges and new opportunities including learning technologies, products and platforms like Cloud native development,\n\n* Containerization, Microservices, Event driven and reactive architectures, as part of an application modernization journey.\n\n### Responsibilities\n\n* As a Front end developer you'll be exposed to end-to-end development, across various cloud platforms, with the aim to empower and enable your clients to thrive in the cloud-based business ecosystem.\n\n* Lead / Participate in design sessions and provide technical leadership (including technical decisions, technology recommendations, defining standards, leading POCs, and mentoring developers);\n\n* Work with project sponsors during the project planning phase to understand the requirements to define and design solution that meets the business and technical needs of the client;\n\n* Define the strategy and overall vision for solutions. Provide complete solution designs that consider cost, performance, scalability, reusability, and extensibility;\n\n* Document application requirements, technical specifications, use-cases, workflow processes;\nOccasionally conduct research and Proofs of Concept on new technologies and applications;\nMentor and develop skills of other members of the team.\n* Collaborate with other development and integration team members to ensure Integration technologies and patterns are properly implemented and maintained;\n\nActively be involved in the functional and technical discussion with the client;\nPerform estimations based on industry widely known of project specific methods and tools;\nCreate and deliver technical design, solution architecture and perform product integration (including unit testing, integration and system tests);\n\nActively be involved in all the project phases: analysis, design, implementation, test/acceptance\n\nThis role can be performed from Toronto - Ontario.\n\n### Required Technical and Professional Expertise\n\n* 6-8 years of experience in technology or related field with relevant experience across financial & banking industry/clients.\n\n* Experience with Front end, Web development technologies including HTML, CSS, JavaScript as well as experience with either Angular or React,\n* Familiarity with integrating and supporting features provided by external SDKs or libraries (e.g. push, analytics, CMS)\n* Understanding of design patterns, optimization, API security and secure coding best practices\n* Experience in creation of solutions for responsive web and mobile\n* Hands-on experience with building secure, scalable, performant, and highly available APIs\n* API Development language and frameworks, such as Java/Spring Boot (preferred), NodeJS, Python\n* Experience building REST API, hands on experience with API gateway such as Apigee.\n* Relational database (PostgreSQL, Oracle, for example) and/or document database (MongoDB), Data modelling, data query (SQL,, e.g.).\n* Experience with GraphQL\n* Familiarity with Containerization, architecture, tools and framework like Docker and Kubernetes, hands on experience preferred\n* Understanding and experience with one commercial cloud solutions such as Azure (preferred), GCP, AWS\n* Understanding of the software development lifecycle & agile delivery principles\n* Knowledge and experience with DevOPS/CICD pipelines and tools such as JIRA, Github, Jenkins, UCD\n* Agile methodology such as Scrum, SAFe and Kanban\n* Excellent communication skills\n* Prior Consulting experience & exposure to SCRUM.\n\n### Preferred Technical And Professional Expertise\n\nDevops Experience.\nSCRUM environment exposure.\n\n### About Business Unit\n\nIBM Consulting is IBM’s consulting and global professional services business, with market leading capabilities in business and technology transformation. With deep expertise in many industries, we offer strategy, experience, technology, and operations services to many of the most innovative and valuable companies in the world. Our people are focused on accelerating our clients’ businesses through the power of collaboration. We believe in the power of technology responsibly used to help people, partners and the planet.\n\n### Your Life @ IBM\n\nAre you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities.\n\nEvery IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change – to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone.\n\nIt's time to define your career.\n\n### About IBM\n\nIBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world.Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world.\n\n### Location Statement\n\nMust have the ability to work in Canada without sponsorship.\n\nThis role will involve working with technology that is covered by Export Regulations sanctions. If you are a Foreign National from any of the following US sanctioned countries (Cuba, Iran, North Korea, Syria, and the Crimea, Luhansk and Donetsk regions of Ukraine) on a work permit, you are not eligible for employment in this position.\n\n### Being You @ IBM\n\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
      "datePublished": 1666183795329,
      "companyName": "IBM",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Armonk, New York",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["css", "react.js", "html", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "vN9AlsavoN",
      "link": "https://jsjobbs.com/javascript-jobs/vN9AlsavoN-frontend-engineer-nova-labs",
      "title": "Frontend Engineer",
      "description": "Nova Labs is the founding team behind the Helium Network, the world’s fastest-growing decentralized wireless network, now live in over 74,000+ cities and 182 countries.\n\nNova Labs was founded in 2013 by Napster Founder Shawn Fanning, Amir Haleem, and Sean Carey, with a mission to make it easier to build connected devices. The company has raised equity funding from some of the most prominent Venture Capital (VC) firms in the world including GV (formerly Google Ventures), Khosla Ventures, FirstMark Capital, Marc Benioff, MunichRe and others.\n\nWe’re searching for an experienced hands-on front end engineer to help us build out and maintain the Nova Labs website.  This role will work closely with our Product, Marketing, and Design teams to develop a robust and beautiful website, develop content, and drive website traffic.\n\n### Responsibilities:\n\n* Building and testing aesthetic, functional, and user-friendly websites.\n\n* Coordinating with designers, content providers, and management or business owners.\n\n* Implementing and ensuring website security and data protection.\n\n* Deploy and maintain websites using hosting providers such as Heroku or Fly.io\n\n* Monitoring and analyzing site performance.\n\n* Updating website content and monitoring how the site shows up in search results, social media posts.\n\n* Ensure our UI components and libraries are reliable, secure, extensible and accessible.\n\n### Minimum requirements\n\n* 2+ years of professional hands-on software development experience.\n\n* Product-focused, driving the design, development, and implementation in order to turn a user's pain points into simple and elegant solutions.\n\n* Building web applications using React, HTML, and CSS.\n\n* You excel at building data visualizations using libraries.\n\n* You develop visualizations that enable engineers and leaders to explore and understand data.\n\n### Nice to have\n\n* Next.js\n\n* Familiarity with digital marketing tools\n\n* Adwords, A/B testing, Meta Ads Manager\n\n### Benefits\n\n* 100% company-paid health insurance premiums (medical, dental, and vision) for you and your dependents.\n\n* Flexible paid vacation with a vacation stipend.\n\n* Paid company holidays.\n\n* Monthly wellness stipend.\n\n* Annual hardware stipend\n\n* 401K plan (no match)",
      "datePublished": 1666181558668,
      "companyName": "Nova Labs",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "REMOTE",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["nextjs", "react.js", "heroku", "html", "css"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "Y5VWgvsUtxeT",
      "link": "https://jsjobbs.com/javascript-jobs/Y5VWgvsUtxeT-senior-software-engineer-frontend-textus",
      "title": "Senior Software Engineer, Frontend",
      "description": "### OVERVIEW\n\nTextUs is looking for a Senior React Engineer to join our team and to help us build our applications. These include a UI, Chrome Extension and Mobile Application.\n\n### WHO YOU ARE\n* 5+ years of writing software overall \n* 3+ years of experience developing production React applications professionally\n* Comfortable working in a 100% remote environment\n* An included statement in your application on how you have worked with React at production scale\n\n### You are also\n* Driven to create and maintain stable, re-usable interfaces in collaboration with our UX designers  \n* Proficient in writing excellent documentation to guide our partners, development and support teams. \n* Excited to mentor junior developers in good development practices for clean code and reliable software. Someone that has empathy for others and enjoys helping them when they are stuck.\n* Familiar with functional design patterns\n* Able to demonstrate pragmatic decision-making and problem-solving abilities.\n* Passionate about the craft of programming, taking the time to think through hard problems and using your tools to develop reliable and maintainable software.\n* Eager to maintain a robust CI/CD tooling, processes, testing, and procedures.\n* Willing to take ownership of different sections of the application, becoming the go-to person on the team for all aspects of it, from planning and stories to QA and support questions.\n\n### This is our stack:\n* React\n* Ruby on Rails\n* Typescript\n* React Native\n* Material UI\n* Postgres\n* ElasticSearch\n* Heroku and AWS\n\n### Skills (Must Have)\n* Functional React\n* Hooks\n* Typescript\n* Redux\n* React Testing Library\n\n### Skills (Nice to Have)\n* Material UI\n* Websockets\n* Nivo\n* RxJS\n\n### EMPLOYMENT DETAILS\n* Job Type: Full Time\n* Compensation Range: $130,000 - $150,000\n* Location: Remote / Denver, CO\n# of hires for this role: 1\n* Target Start Date: 4 weeks from offer date\n* Reporting to: Engineering Manager\n* By submitting your resume for this role - you consent to communication via email and text\n\n### INTERVIEW PROCESS\n* Initial call w. HR Manager (30 mins via Phone)\n* Topics: Culture, logistics \n* Interview w. Hiring Manager (30 mins via Zoom Video)\n* Topics: Culture, leadership, skills, role overview\n* Pairing Session w. Backend Team (2 hrs via Zoom Video)\n* Topics: Culture, skills, role overview\n* Rembrandt Assessment\n* The Rembrandt assessment allows TextUs to assess how your personality fits within the role and the TextUs culture. \n* Q&A w. CTO (30 mins via Zoom Video)\n* Topics: Culture, leadership, skills. Also, please come prepared with questions about the role, team, and product to ensure this role is the best fit for you.\n\n### WHY TEXTUS\n\nOur Engineering Team is guided by high empathy and high responsibility. This means that we care about our engineers’ career trajectory and their thoughts on our product direction and implementation. Our engineers are trusted with autonomy: the latitude in how and when work gets done. We are a collaborative, learning and data-driven culture with an experienced and proven leadership team. \n\n### TextUs Benefits include:\n* Competitive pay\n* Health / Dental / Vision Insurance\n* HSA contributions\n* 401K with company match\n* Unlimited PTO\n* Equity within the organization\n* Cell phone + internet reimbursement for $100/month\n* One-time $1,000 home office stipend once you’ve been with TextUs for 6 months\n* Up to 12 weeks of Parental Leave \n* 8 Observed Holidays + End of Year Shutdown\n* U.S. remote first with optional WeWork office space in downtown Denver, CO\n\nTextUs does not discriminate based on race, color, religion (creed), gender, gender expression, age, national origin (ancestry), disability, marital status, sexual orientation, or military status, in any of its activities or operations. We are committed to providing an inclusive and welcoming environment for all members of our staff, volunteers, subcontractors, vendors, and clients.",
      "datePublished": 1666181125511,
      "companyName": "TextUs",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Denver, CO",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["redux", "react.js", "typescript", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "suAPiUsveDduolC",
      "link": "https://jsjobbs.com/javascript-jobs/suAPiUsveDduolC-fullstack-react-typescript-developer-clouddevs",
      "title": "Fullstack React Typescript Developer",
      "description": "CloudDevs is helping world-class, venture-backed startups find talented JS/typescript developers. You will be employed by one of these startups and play an integral role in their early-stage growth.\n\n\n\n### Minimum qualifications:\n\n* Bachelor's degree in Computer Science or equivalent practical experience\n* 7+ years of work experience as a software engineer or relevant experience\n* Strong and confident communicator in English\n* Strong problem solver\n* Comfortable with collaboration and open communication across distributed teams\n\n### Preferred qualifications:\n\n* Proven track record of shipping software and successfully released apps (please include names and links on your resume)\n*  5+ yrs of commercial experience using React or Angular or Vue with Node js in the backend. \n* Strong technical design and development skills\n* Experience with Continuous Integration\n* Proven work experience inside of a distributed team, in a remote environment\n* Strong attention to detail on every line of code, every unit test, and every commit message\n* Comfortable with rapid development cycles and tight schedules\n\n### What's In It For You?\n\n* Most of our clients offer remote work and competitive compensation with bonuses, stock options, and PTO\n* Apply once and get matched with multiple pre-vetted employers\n*  Salary and compensation\n\n$90,000 — $110,000/year",
      "datePublished": 1666180081496,
      "companyName": "CloudDevs",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco",
      "offersRemote": true,
      "remoteLocations": ["Europe", "United States"],
      "tags": ["javascript", "node.js", "react.js", "angular"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "EhfaY3yojknaB",
      "link": "https://jsjobbs.com/javascript-jobs/EhfaY3yojknaB-senior-software-engineer-full-stack-bankjoy",
      "title": "Senior Software Engineer - Full Stack",
      "description": "Despite our name, Bankjoy is not a bank! We are a silicon valley backed FinTech going through significant growth. We are on track to 20x revenue over 2 years and grow our team from 7 to 100. Check out our investors Y Combinator and Bessemer Venture Partners and the impressive list of companies they have invested in! We are changing the way community banks and credit unions do business, enabling them to become tech-driven and digital first. Bankjoy provides modern digital banking products including mobile banking, online banking, online account opening, loan origination, and conversational AI. Our mission is to revolutionize banking tech infrastructure by leading digital transformation at financial institutions — big and small.\n\n### The Role\n\nWe're looking for a talented Senior Software Engineer to work on our Online Account Opening & Online Loan Origination team! You will be responsible for developing digital banking products, features, and APIs.\n\n### In this role, you will:\n* Build a world-class user experience.\n* Design engineering architecture for feature systems spanning web/app frontends, APIs, microservices, and databases.\n* Contribute to backend and API services.\n* Tackle tough design and product problems.\n* Work cross-functionally with design, product, and engineering to deliver great user experiences.\n* Provide technical leadership in domain areas. \n\n#### What you bring:\n* Must have 5+ years of C# and .NET Core experience.\n* Must have 5+ years of JavaScript, HTML, and CSS experience\n* Must have 7+ years of software development experience\n* Angular, React, or Vue experience preferred\n* Experience working in a startup-like environment preferred\n* Great communication skills\n* B.Sc. in Computer Science, Computer Engineering, or equivalent working experience\n\n### What you get:\n* A fast-paced and collaborative environment\n* Competitive compensation\n* Stock options at a well-funded startup in high growth\n* 100% medical, dental and vision coverage for you. We cover family's at 50%. (US Employees)\n* 401(k) plan with 4% company matching (US Employees)\n* 4 weeks PTO and 5 health days\n* Performance-based bonuses\n* Remote first culture\n\n### Equal Employment Opportunities at Bankjoy\n\nBankjoy is committed to hiring talented and qualified individuals with diverse backgrounds for all of its tech, non-tech, and leadership roles. Bankjoy provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age or disability.",
      "datePublished": 1666103412629,
      "companyName": "Bankjoy",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Royal Oak",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["c#", "react.js", ".net", "angular", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "u7SOu2hcetrevelC",
      "link": "https://jsjobbs.com/javascript-jobs/u7SOu2hcetrevelC-senior-javascript-engineer-react-clevertech",
      "title": "Senior Javascript Engineer - React",
      "description": "Experience Remote done Right. Over 20 years of remote experience, all 500+ staff are 100% remote and we still grow vibrant relationships, and provide exceptional opportunities for career growth while working with stellar clients on ambitious projects\n\n### What we're working on:\n\n* Enterprise companies turn to us to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. The problems we solve every day are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. In order to grasp the scale of problems we face, ideally, you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries\n\n\n### Requirements\n* 7+ years of professional experience (A technical assessment will be required)\n* Senior-level experience with Javascript, React, Redux, Websockets, Async/Await\n* Ability to create clean, modern, testable, well-documented code\n* English fluency, verbal and written\n* Professional, empathic, team player\n* Problem solver, proactive, go getter\n* Straight from the Devs\n\nWatch short snippets of actual developers (Real, not scripted) share why they joined YouTube Playlist\n\nWhy Clevertech is an amazing place to work at\n\n### At Clevertech, you can expect that you will:\n\n* Be 100% dedicated to one project at a time so that you can hone your skills, innovate and grow\n* Be a part of a team of talented and friendly senior-level developers\n* Work on projects that allow you to use cutting edge tech. We believe in constantly evolving your mastery\n\nThe result? We produce meaningful work and we are truly proud and excited to be creating waves in an industry under transformation",
      "datePublished": 1666094573333,
      "companyName": "Clevertech",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "New York, New York",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["redux", "react.js", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "z6LdAHbalS",
      "link": "https://jsjobbs.com/javascript-jobs/z6LdAHbalS-frontend-engineer-slab",
      "title": "Frontend Engineer",
      "description": "At Slab, we believe that knowledge is the foundation of any organization's success. When a team's collective knowledge is accessible, that team's potential is limitless. That's why we're making the workplace a source of learning and purpose through knowledge-sharing. Our product helps teams easily create, organize, and discover knowledge across the entire company, from non-technical to tech-savvy. Thousands of customers rely on Slab across their entire workforces, including Asana, Benchling, and Fivetran.\n\nAs a small product-focused company, you'll join a team of experienced engineers, working on shipping features that delight users, fixing issues that get in their way while keeping our codebase, infrastructure, and tooling modern and well-maintained. We are globally distributed, with processes that minimize meetings and overhead, letting makers build on the maker's schedule.\n\n### Technologies we use:\n* React + TypeScript + Sass\n* GraphQL + Apollo + Absinthe\n* Elixir + Phoenix\n* Postgres + Redis\n* Docker + Kubernetes\n* Google Cloud Platform\n\n### Sound like you?\n* You have a strong technical background, with experience solving complex engineering challenges\n* You love delighting users with great product experiences and resolving issues that get in their way\n* You're curious to learn and demonstrate the ability to do so very quickly\n* You communicate with clearly and concisely, whether with teammates or users\n* You are self-motivated and possess a strong work ethic\n* You are passionate about knowledge-sharing and identify with Slab's mission and values\n\n### What we value:\n* Stay lean - We strive for the greatest possible impact with the fewest number of employees. We empower our teammates with the most leveraged tools and efficient processes.\n* Default to open - We encourage and nurture open exchanges of knowledge and ideas — while acting with respect and regard for each other.\n* Think rigorously - We act and execute after careful thought and examination of known information, while acknowledging the risks we accept in its absence.\n* Say no - We aim to deliver exceptionally high value in a small set of focus areas. We willingly abstain from good ideas to give only the most promising paths the attention they deserve.\n* The best prevails - Whether an idea or an individual, the best will rise to the top at Slab. Ideas we pursue can come from anywhere, and individuals gain responsibilities due to outperformance.\n* Global optimization - We believe that our mission — to make the workplace a source of learning and purpose — is the ultimate priority, above any single project, team, or individual.\n\n### Benefits:\n* Full health insurance (USA) or stipend (International)\n* Wellness & remote work stipends\n* $5k workspace setup, renewed biannually\n* 7-year options exercise window\n* Slab is an equal opportunity employer. We welcome people of diverse backgrounds, experiences, and perspectives",
      "datePublished": 1666093717774,
      "companyName": "Slab",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["typescript", "react.js", "kubernetes", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "NVwURGegnarorevlis",
      "link": "https://jsjobbs.com/javascript-jobs/NVwURGegnarorevlis-full-stack-react-web-developers-silverorange",
      "title": "Full Stack React Web Developers",
      "description": "### The Company\nSilverorange is a design and development agency based in Canada. When pursuing work, we focus on interesting and meaningful projects. Over our 22 years as a company, we've worked with well-known technology organizations like Duolingo and Mozilla, not-for-profit organizations working in areas including arts funding and affordable internet access for low-income families, and with world-renowned doctors training other doctors through online education.\n\nWe’re proud of the fantastic products we've built in partnership with our clients and we’re actively invested in the processes behind these products. Within the next 6 months, we expect our team to grow from 29 to 35 people in order to meet the needs for new and existing projects. Our growth is careful and considered, though we have no plans for becoming a large organization. We are committed to fostering a team focused as much on quality of life, openness, empathy, and a supportive work environment as it is on building great user-focused systems.\n\n### The positions\nWe’re looking for several Full Stack React Web Developers to join our team. We are open to developers of various experience levels, and ideally you’ll be joining us with at least one prior full-time experience working as a React Developer within a team. We favour applicants with a strong sense of ownership over their own work. Excitement and ability to learn and contribute is more important to us than other metrics like years of experience.\n\nYou’ll start your silverorange career on an internal team focused on a medical education client, helping us to develop and maintain their products as well as contribute to planning and implementing new features.\n\nThese positions are available immediately and we will work with you to get you started as soon as possible.\n\n### Growth & ownership\nOur team is co-operative and will help you learn and expand your skills via mentoring, team-wide support, and learning opportunities. All members of the team are encouraged and given space to grow as individual contributors, and have ongoing opportunities in project and team leadership.\n\nWe’re excited to hear your fresh ideas and approach. We have decades of collective experience, and we all continue to become better at what we do by both teaching and learning from each other. Add your voice to our mix.\n\nOpportunity for employee ownership is a fundamental part of silverorange (non-founders currently own more than a third of the company) and we’re currently working on new ways to transfer even more ownership to employees.\n\n### Inclusion & diversity\nPeople with different backgrounds and experiences make us stronger, and we’re always looking for ways to improve. Our team is getting more diverse across many dimensions of diversity, but we’re still missing perspectives that could make our work better. We highly encourage people from traditionally underrepresented groups in our industry to apply—we’d love to hear from you.\n\n\n### Responsibilities\n* Implementing features and improvements on a mix of React Web and React Native applications.\n* Reviewing code and content changes from other developers on the project.\n* Working from mockups (this project uses Figma), wireframes, and design systems.\n* Communicating with team members and clients to understand and balance requirements.\n* Identifying and helping to address accessibility issues in Web and mobile systems.\n* Writing tests for your work.\n\n### Requirements\n* Be eligible & available to work from Canada\n* Have an understanding of core front-end Web technologies, including HTML, CSS, and JavaScript, and understand how these standards relate to libraries like React.\n* Have an understanding of the fundamentals of React Native and how it differs from React on the Web\n* Have experience using React to develop Web applications or React Native to develop Applications on iOS and/or Android.\n* Have some experience using version control systems like Git to manage changes.\n* Be able to communicate clearly with clients and co-workers across multiple time zones. Several of our key clients are in California and we have team members in British Columbia, Alberta, Ontario, Quebec, New Brunswick, Nova Scotia, PEI, as well as Ecuador and the United Kingdom.\n\n### While not required, if you have any of the following skills let us know:\n* API development in Node/Express\n* Working with Firebase\n* TypeScript\n* Next.js\n\nRemote working is just as good as local\nOur team has been remote-friendly for over 20 years, and remote-first for the last 7. We continue to improve our approach to having a dispersed team. Due to COVID-19 this position will start as full-time remote regardless of location, though you are welcome to work from our lovely offices in Charlottetown, Prince Edward Island, Canada once they are re-opened.\n\nOver half of our team is full-time remote and 95% of our clients are remote. You’ll need to be comfortable working with a remote team regardless of your location.\n\nTypically all employees spend at least one week each year working from our Charlottetown office so plan on visiting PEI semi-regularly once you feel safe traveling.\n\nThough you may be working remotely, you’ll be an active member of a great and small but growing team, both here at silverorange and with our clients. Regular voice or video communication will help keep you in touch with the smart people with whom you’ll be working.\n\n### Benefits & compensation\n* Flexible work days, approached collaboratively with you to allow for the realities of appointments, family minding, and your everyday life.\n* 3 weeks of paid vacation, on top of 10 paid days of civic holidays, and 3 weeks of paid company-wide shut down.\n* Generous health and dental coverage, with 100% of premium covered by silverorange.\n* New computer hardware every 3 years, and other tools as needed.\n* Yearly company-wide bonuses based on overall company success, plus ownership opportunities and dividends for long-term employees.\n* Salaries based on experience starting at CAD $59,000-67,500 per year for those earlier in their career and CAD $82,500-94,500 per yea per year for more senior candidates, with both annual company wide salary band adjustments as well as opportunities and expectation of ongoing career and compensation growth.\n* Additional remote worker salary add-on of CAD $3,000 per year and a wellness salary add-on of $500 per year.\n\n### How to apply\nClick 'Apply' and include a copy of your resume, links to relevant examples of recent work (GitHub or an equivalent profile is a great place to start), and an explanation of why you’d be great for the job. Tell us about an interesting project you’ve worked on or helped ship.\n\nWe want people to feel they can be their genuine selves at work, so we’d love to hear about who you are. If there is anything else you would like to share with us — i.e. a Medium or Twitter account, online writing or select blog posts, etc. — please feel free to include those as well.\n\nIf you require accommodations at any phase of the application or interview process, please let us know by email. We would be happy to support you and discuss accommodations as required",
      "datePublished": 1666092738796,
      "companyName": "silverorange",
      "companyLogo": "",
      "countryName": "Canada",
      "countryAbbreviation": "CA",
      "state": "Charlottetown, PE",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["javascript", "react.js", "react native"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "Dvpgd2MRCraguS",
      "link": "https://jsjobbs.com/javascript-jobs/Dvpgd2MRCraguS-junior-software-developer-romania-only-sugarcrm",
      "title": "Junior Software Developer (Romania Only)",
      "description": "We are looking for a highly motivated Jr Developer to maintain and build out our advanced demo environment. In this key role you will join the Sugar Labs and build company critical assets. The Sugar Labs, a part of the Strategy Department, is a Service Center dedicated to SugarCRM demo environment and innovation.  \nYour main focus will be software development: build state of the art software and tools for the demo environment. Write ongoing improvements. Create new software to integrate with our Marketplace. \nThis role will include another important focus: operations. This skillset is not required, you will learn with the help of the other team members. Operations skillset includes: maintain the demo environment. That consists in maintenance, running upgrades, monitoring the environment, writing server scripts to automatize deployments, backups, termination, hot fixes and also support our users via a ticketing system. Support other departments helping to access to prereleases. \n \nYou will join a small team ofdevelopers, follow up with sensitive projects and ensure the delivery quality. To be successful in this role, you must be comfortable working in a fast-pacedenvironment andmanaging your time effectively. You will report to the Sugar Labs Director. \n\n### IMPACT YOU WILL MAKE IN THE ROLE:\n\n* Help building and improving company critical assets \n* Track your time spent \n* Closely work with the Developer Team Lead and the Project Manager \n* Understand and challenge the requirements \n\n### EXPERTISE YOU WILL BRING IN:\n\n* 1+ year of experience with enterprise software development and/or distributed SaaS systems \n* 1+ year of software programming for the web \n* Client side, server side and data store experience is required \n* 1+ year of experience with creating and consuming RESTful APIs \n* 1+ year of experience with PHP, JavaScript \n* 1+ years with databases (e.g. MySQL, SQL Server, PostgreSQL)\n* Good communication skills across a global cross-functional audience \n* Bachelor's Degree in Computer Science or related field, or 1+ years relevant work experience \n* Proficient communication skills in both English and Romanian \n\n### NICE TO HAVE:\n\n* Experience with gnu/Linux server administration and security is a plus \n* Experience with AWS environment is a plus (EC2, RDS, IAM, Connect, Lambda) \n* Experience with cloud services \n* Experience with continuous delivery and/or continuous integration \n* We understand that no candidate is perfectly qualified for any job. Experience comes in different forms; many skills are transferable; and passion goes a long way. Even more important than your resume is a clear demonstration of dedication, impact, and the ability to thrive in a fluid and collaborative environment. We want you to learn new things in this role, and we encourage you to apply if your experience is close to what we’re looking for. We also know that diversity of background and thought makes for better problem solving and more creative thinking, which is why we're dedicated to adding new perspectives to the team.\n \n### Benefits and Perks:\nBeyond a stellar work environment, friendly people, and inspiring work, we have some sweet benefits and perks:\n \n- Private medical and vision benefit coverage\n- Health &Wellness Reimbursement Program\n- Educational Resources - Career & Personal Development Program\n- Attractive salary package\n- Flexible work hours\n- Meal tickets\n-Football Team\n-We are a merit-based company with many opportunities to learn, excel and grow your career!",
      "datePublished": 1666091538611,
      "companyName": "SugarCRM",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Cupertino, CA",
      "offersRemote": true,
      "remoteLocations": ["Europe"],
      "tags": ["php", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "01dUHkduolC",
      "link": "https://jsjobbs.com/javascript-jobs/01dUHkduolC-senior-full-stack-engineer-cloud-cybeats",
      "title": "Senior Full Stack Engineer",
      "description": "Cybeats is looking for an experienced Engineer with multidisciplinary knowledge in SDLC and an understanding of DevOps culture best practices backed up by fluent familiarity with modern source control systems to join our team and develop the next generation of embedded IoT Cybersecurity solutions.\n\n### Qualifications\n* Full-Stack Software Development 5+ years\n* B.Sc in Computer Science / Electrical Engineering or equivalent experience\n\n### Responsibilities\n* Gather requirements, preparing design documentation, and creating mockups\n* Writing node.js code for implementation of serverless backend REST API\n* Writing frontend code using Angular, SVG, CSS, HTML, DOM\n* Writing integration and unit tests to increase the quality of code\n* Refactoring existing codebase to improve maintainability, increase testing coverage, and optimizing performance\n\n### Requirements\n* 3 years experience developing REST API utilizing JWT\n* 3 years experience in Node.js, ES6\n* 3 years experience working with Angular widget is driven development\n* Good understanding of secure client-server communication\n* Experience working with cloud environments AWS/GCP/Azure\n* Understanding of GIT and CI/CD practices and tools\n* Can-do attitude\n\n### Advantages\n* Experience implementing solutions working low level with network protocols\n* Experience in developing cybersecurity solution backend or frontend\n* Familiarity with NoSQL Databases and Data Lake concepts\n* Familiarity with serverless technology API Gateway + Lambda\n* Understanding SAST/DAST/IAST tools and debugging techniques\n* Knowledge of test automation and code quality tools (Jenkins, Mocha, Chai, Nyc, Sonarcube)\n* Familiarity with K8S, Terraform, and the containerized environment\n* Knowledge of IDP solutions and experience integrating them\n* Working on projects involving Machine Learning\n\n### What we offer:\n\n* Benefits - Full-time employees receive medical and dental coverage in Canada and US\n* Professional Growth - let us know where you want to improve and we will support you\n* Fun Lunch - enjoy a monthly lunch on us and a chance to mingle with others\n* Flexibility - we offer a hybrid setup, where role description permits, to promote a work life balance\n* Rest and Relaxation - at Cybeats we value your well-being and the need to recharge, start with 3 weeks of vacation and unlimited sick days\n* Family Time - Maternity leave top up and time off for new parents\n* Cutting Edge - join us on our journey of cutting edge technology and exciting new projects\n\n\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties, or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.\n\nCybeats is an equal opportunity employer. We enthusiastically accept our responsibility to make employment decisions without regard to race, religious creed, color, age, sex, sexual orientation, national origin, ancestry, citizenship status, religion, marital status, disability, military service or veteran status, genetic information, medical condition including medical characteristics, or any other classification protected by applicable federal, state, and local laws and ordinances. Our management is dedicated to ensuring the fulfillment of this policy with respect to hiring, placement, promotion, transfer, demotion, layoff, termination, recruitment advertising, pay, and other forms of compensation, training, and general treatment during employment.",
      "datePublished": 1666020110319,
      "companyName": "Cloud Cybeats",
      "companyLogo": "",
      "countryName": "Canada",
      "countryAbbreviation": "CA",
      "state": "Toronto",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["node.js", "javascript", "angular"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "oPR2xWoinomeL",
      "link": "https://jsjobbs.com/javascript-jobs/oPR2xWoinomeL-full-stack-developer-react-node-lemonio",
      "title": "Full-stack Developer (React/Node)",
      "description": "Get a remote job that you will love with better compensation and career growth.\n\nWe’re Lemon.io — a marketplace where we match you with hand-picked startups from the US and Europe. \n\n### Why work with us:\n* We’ll find you a team that respects you. No time-trackers or any micromanagement stuff\n* Our engineers earn $5k - $10k / month. We’ve already paid out over $10M.\n* Choose your schedule. We have both full- and part-time projects.\n* No project managers in the middle — only direct communications with clients, most of whom have a technical background\n* Our customer success team provides life support to help you resolve anything.\n* You don’t have to look for clients and or negotiate anymore: just do what you do best and leave us the rest.\n\n### Requirements:\n* 3+ years of software development experience\n* Strong knowledge of JavaScript (Core, DOM APIs)\n* 3+ years of experience with Node.js\n* Experience with front-end JavaScript frameworks and libraries (React.js preferably)\n* Understanding of and practical experience with SOLID principles and GOF patterns\n* Understanding of CI principles\n* Experience with Typescript and React Native would be a plus\n\n* Good command of English, both written and spoken, as you’ll be communicating with clients directly\n* Strong organizational skills — ability to work full-time remotely with no supervision\n* Responsibility — we want to trust you\n* Soft skills — we don’t ask you find a topic for a small talk, but being just polite is OK\n\nApply today, and our team will get back to you within 2 business days!",
      "datePublished": 1666018192629,
      "companyName": "Lemon.io",
      "companyLogo": "",
      "countryName": "Ukraine",
      "countryAbbreviation": "UA",
      "state": "Kyiv",
      "offersRemote": true,
      "remoteLocations": ["Europe", "United States"],
      "tags": ["javascript", "node.js", "react.js"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "qg9zzLalliroGtseT",
      "link": "https://jsjobbs.com/javascript-jobs/qg9zzLalliroGtseT-remote-senior-frontend-engineer-angular-testgorilla",
      "title": "Remote Senior Frontend Engineer (Angular)",
      "description": "### Hi there,\n\nI’m Nicolas, TestGorilla’s Head of Engineering. We’re a fast-growing HR tech startup that helps hiring teams make better hiring decisions faster and bias-free.\n\nOver the past year, we’ve experienced tremendous growth. More than 7,500 companies have replaced CVs with our assessments to screen candidates in an unbiased and data-driven way.\n\nAs we scale our efforts in 2022 and beyond, we’re looking for a Senior Frontend Engineer who’s passionate about joining our quest to help people land dream jobs.\n\n\n\n### The proposition\n\n* Helping shape a fast-growing HR tech startup as an early employee\n* Fully remote position with bright, motivated, and friendly colleagues around the world \n* Competitive salary incl. bonus and stock options\n* Flexible hours and vacation\n* Paid parental leave \n* €1000 remote working budget per year\n* 3.5% of salary learning & development budget\n\n\n### The role in context\n\nWe are looking for a Senior Frontend Engineer to join our engineering department and help us bring our product to Enterprise level maturity. Your work will directly impact hundreds of thousands of users around the world.\n \nAs a senior member of the engineering team, you will build and deliver frontend solutions to provide extraordinary product experiences for our users, including SPAs and reusable components for the rapid growth of all our products.\n \nYou’ll own the design, code, and deployment of solutions and make sure they perform and scale in production. \n \n\n### You’ll spend time on the following\n\n* Take full ownership of the frontend; from low-level optimizations to improving user experience\n* Build reusable code and libraries for future use\n* Ensure the technical feasibility of UI/UX designs and propose features and functionalities to the product team\n* Optimize the application for maximum speed and scalability\n* Lead the entire software development and delivery cycle from ideation to deployment and everything in between\n* Efficiently utilize DevOps tools and practices to deliver high-quality software as well as value to end customers as early as possible\n* Work in a collaborative, talented distributed team across Europe, United States, South America, and Asia\n* You will act as a mentor for less-experienced team members through both your technical knowledge and leadership skills\n\n\n### Here’s what we’re looking for\n\n* You are inspired by our mission to put one billion people in dream jobs\n* You are fully aligned with our values\n* Experience designing, implementing, running, and maintaining production front-end code using modern client-side development frameworks based on JS/TS such as Angular\n* You strive for excellence: pixel-perfect, high-quality code, and lightning-fast load times\n* You care deeply about building a world-class engineering team\n* You have a solid understanding ofUX/UI design, usability, and accessibility\n* You are passionate about improving skills and learning new technologies\n* You enjoy influencing others and always advocate for technical excellence while being open to change\n* You’re resilient in ambiguous situations and can approach challenges from multiple perspectives\n* You have strong written and verbal communication skills. You can validate your decisions and communicate them clearly\n* We typically expect candidates with at least 7 years of  Senior Frontend Engineer experience to have the skills mentioned above.\n\n### Bonus points if ...\n\n* you have experience in a SaaS product based company\n* you are comfortable with Agile methods, such as Extreme Programming (XP), Scrum, and/or Kanban\n* you have a working knowledge of cloud technology such as AWS, Azure, Kubernetes, and Docker\n\n### Interested?\n\nHere at TestGorilla, we eat our own dog food. We use our assessment platform to make sure we make the best hiring decisions faster and bias-free. I took one too and I enjoyed it!\n\nSo if this role sounds like a good fit for you, I’d like you to take an assessment so we can get a better idea about whether you would fit the role. It’s also a great opportunity for you to get to know our product! Simply use the Apply button.\n\nIf you’re hired, I’ll do everything I can to help you succeed at TestGorilla and throughout the rest of your career.",
      "datePublished": 1666009953823,
      "companyName": "TestGorilla",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Amsterdam",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["angular", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "sMPoVsmoolbrevE",
      "link": "https://jsjobbs.com/javascript-jobs/sMPoVsmoolbrevE-senior-full-stack-web-developer-everbloom",
      "title": "Senior Full Stack Web Developer",
      "description": "We are hiring a Senior Full Stack Web Developer to help build out our NFT platform.  As we grow, you'll be responsible for helping to manage our engineering organization and will help with hiring as well. This will be an incredibly crucial, exciting, and creative role. We are looking for someone passionate about creativity, digital self-expression, and decentralization.\n\n\nThe position is fully remote, but 4+ hours of working day overlap with the CET timezone is required.\n\n### Responsibilities\n\nArchitect and build new features, tools, and workflows for Everbloom’s web marketplace\nBuild clean, testable, maintainable, and idiomatic code, and drive the team forward in relation to code quality\nCollaborate with Design, Product, and Marketing teams in prototyping, user testing, and implementing new features\nPartner cross-functionally with fellow engineers to ensure consistency is maintained across platforms\n\n### Job Requirements:\n\n* Solid knowledge of best practices in engineering and architecture\n\n* 4+ years Front-end development experience with Javascript, React/Next.js\n\n* Good eye for pixel-perfect UI\n\n* 4+ years Back-end development experience with Node/Express.js/Serverless/MongoDB/PostgreSQL/Firestore or similar DB tech\n\n* Experience in building scalable backends\n\n* Rapid prototyping experience\n\n* Capability to work on tight deadlines\n\n* Excellent English communication, written and verbal\n\n* Excellent problem-finding and solution-finding skills\n\n* Interest in Web 3 / Blockchain technologies\n\n### Preferred Qualifications:\n\n* Solidity or Cadence smart contract development and/or passion for Web 3 products\n\n* Prior experience working in fast-moving teams\n\n* Experience in shipping products\n\n* Passionate about building and shipping products\n\n* Background in consumer apps such as social, fintech, or marketplaces",
      "datePublished": 1665998950157,
      "companyName": "Everbloom",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Amsterdam",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["nextjs", "node.js", "react.js", "mongodb", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "9KoMsnruO",
      "link": "https://jsjobbs.com/javascript-jobs/9KoMsnruO-wordpress-junior-full-stack-software-engineer-remote-full-time-our-hometown-inc",
      "title": "WordPress – Junior Full Stack Software Engineer – REMOTE – Full Time",
      "description": "**Our-Hometown** is looking for Junior to Mid-level Full Stack software engineers to join our small team. Our mission is to make local papers competitive with a bespoke set of tools to cater to their unique needs.\n\n**Duties:**\n1. Developing and maintaining in-house WordPress plugins and themes.\n2. Developing and maintaining mobile ionic applications for iOS and Android.\n3. Handling third-tier customer support tickets.\n4. Must reside in the United States\n\n**Skills Required:**\n1. PHP experience\n2. Javascript experience\n3. WordPress plugin and theme development experience\n4. Some Linux command-line/scripting experience\n5. High-speed internet\n6. Self-motivated\n7. Good communication skills\n\n**Nice to have:**\n* C++ experience\n* Angular / ReactJS experience\n* Git experience\n* AWS experience\n* Home office\n* CSS experience\n* Python / Machine Learning\n\n**Salary:**\n* Based on experience, with regular performance-based raises and/or bonuses.",
      "datePublished": 1665974034033,
      "companyName": "Our Hometown, Inc",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Clifton Springs, NY",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["c++", "react.js", "angular", "php", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "Dm9l7AxoblebaL",
      "link": "https://jsjobbs.com/javascript-jobs/Dm9l7AxoblebaL-senior-software-engineer-frontend-labelbox",
      "title": "Senior Software Engineer, Frontend",
      "description": "Labelbox’s mission is to build the best products for humans to advance artificial intelligence. Real breakthroughs in AI are reliant on the quality of the training data. Our training data platform enables organizations to improve their machine learning models far quicker and more accurately. We are determined to build software that is more open, easier-to-use, and singularly focused on getting our customers to performant ML faster.  \n\nCurrent Labelbox customers are transforming industries within insurance, retail, manufacturing/robotics, healthcare, and beyond. Our platform is used by Fortune 500 enterprises including Allstate, Black + Decker, Bayer, Warner Brothers and leading AI-focused companies including FLIR Systems and Caption Health. We are backed by leading investors including SoftBank, Andreessen Horowitz, B Capital, Gradient Ventures (Google's AI-focused fund), Databricks Ventures, Snowpoint Ventures and Kleiner Perkins.\n\n### About the Perception Team\n \nThe vast majority of machine learning projects fail because of insufficient or poorly labelled data. At Labelbox, the Perception team’s mission is to build the most efficient tool for creating high-quality training data, allowing our users to make breakthroughs in their domains and advance the field of artificial intelligence.\n \nOur team focuses on building a beautiful browser interface, that is served to users all around the world. We focus on use cases that allow humans to annotate media around languages such as audio waveforms, text documents, and PDFs.\n\n### About the Role\n\nAs our Senior Software Engineer on the Perception team, you will be instrumental in pushing the boundaries of what is possible in a web browser. You will work closely with product, design, and other engineers to implement reusable, extensible, performant components that will not only be used internally but can be shared with customers who wish to build their own novel experiences for their labellers. You will balance innovation and pragmatism to deliver on business initiatives and make the right technology foundation for future use cases.\n\nThe bottom line: you will personally build, but also empower other engineers to create jaw-dropping experiences to allow the rendering and annotation of arbitrary real-world data in a web browser.\n\n### About You\n* You have 5+ years with full-stack work using frontend frameworks such as React/Redux, Angular, etc\n* You have 3+ years of professional experience with WebGL\n* You have experience with full-stack development (writing + consuming GraphQL APIs, databases, etc)\n* You have familiarity with browser rendering frameworks such as Konva, Pixi.js, and three.js\n* You are constantly learning and pushing the art of the possible in the Web browser\n* Quality and testing are very important to you but can balance between perfection and shipping\n\n### Projects You Could Work On\n* Unifying the rendering of different drawing tools (polygons, raster graphics, etc) into a WebGL-based rendering engine\n* Reliably synchronize annotations with video playback and scrubbing\n* Supporting the performant rendering of thousands of labels in the browser\n* Building novel experiences for exploring 3D medical imagery\n* Creating frameworks for other developers to leverage in building novel features\n* Shipping new annotation tools\n* Re-imagining + improving the experience of annotating frames in a video\n\n[Do great work. From anywhere.](https://labelbox.com/company/remote-work)\n\nWe hire great people regardless of where they live. Work wherever you’d like as reliable internet access is our only requirement. We communicate asynchronously, work autonomously, and take ownership of our work.\n\n#LI-Remote",
      "datePublished": 1665942960956,
      "companyName": "Labelbox",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco, California",
      "offersRemote": true,
      "remoteLocations": ["South America", "North America", "Europe"],
      "tags": ["react.js", "angular", "webGL"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "Qqy1n9yticolyaP",
      "link": "https://jsjobbs.com/javascript-jobs/Qqy1n9yticolyaP-senior-software-engineer-paylocity",
      "title": "Senior Software Engineer",
      "description": "Many companies offer payroll and human capital management (HCM) solutions, but Paylocity takes technology to the next level. We’ve evolved beyond HCM to a next-generation employee experience platform. With uniquely designed solutions to help companies engage employees, we’ve changed how and where work gets done and created a personalized work environment. Join Paylocity as we continue to transform the future of technology! \n\n\n\nWe give our employees what they need to succeed, including great benefits and perks! We offer medical, dental, vision, life, disability, and a 401(k) match, as well as perks that support you, your family, and your finances. And if it’s career development you desire, we provide that, too! At Paylocity, people matter most and have always been at the heart of our business. \n\n  \n\nHelp Paylocity enhance communication and enable employees to connect, collaborate, and create from anywhere with a position in Product & Technology!\n\n\n\nWant to develop the strategies and principles needed to deliver compelling software? Join our team and help us enhance our all-in-one software platform, elevate our one-of-a-kind technology, and improve the employee experience. \n\n\n\nTake your career to the next level at one of G2's Top 100 Software Companies. Explore our Product & Technology positions to see where you fit! \n\n\n\n### Position Overview:\n\n \n\nSenior Software Engineers are members of our product teams, responsible for creating, enhancing, and supporting common features. Working side-by-side with Product Owners, Software Test Engineers, and Business \n\nStakeholders, they are actively involved in the complete software development life cycle in an agile environment including technical design, hands-on coding, unit testing, integration testing, performance tuning, maintenance, test automation, deploys and upgrades. \n\n\n\nThey also work closely with DevOps, DBAs and Systems Engineers to make deployments easier to improve team velocity and overall quality of delivery. They design, develop and contribute to some of the most important functionality happening in the product category, and also mentor, coach and empower technical team members while still taking a very active role in developing solutions.\n\n\n\nAre you the teammate we are looking for? \n\n\n\n### Who you are:  \n\n\n\nEngineering is the function that applies principles and techniques of engineering, mathematics, and computer/data science to the design, development, and testing of applications. The Product & Technology engineering family consists of software development, testing, database, devops, virtualization & network. \n\nEnthusiastic about developing the best software available and providing the ultimate customer experience \nAn advocate for continuous improvement of our software development process \nInterested in staying current by applying new technologies \nAble to work in a collaborative environment with a willingness to share your ideas \nAble to work independently on modules and complete tasks with high quality and contribute to high velocity, but unafraid to seek out suggestions from other team members \nExcited to work on cutting-edge technology \n\n### What we offer:\n\n*  A compelling mission to elevate payroll and human resources across the backroom and into the boardroom\n* Focus on helping our customers automate manual processes, appeal to the modern workforce, and glean insights from analytics\n* Lean enabling process that focuses on putting our customers at the center of everything we do\n* A commitment to investing in our products, hiring the best talent, and giving them the chance to meaningfully contribute to a vast market opportunity\n* Ample opportunity and encouragement to stay current with external training\n* A phenomenal talent anywhere culture, where employees can work remotely anywhere in the US and/or work from one of three U.S. offices located in Illinois, Florida, and Idaho \n\n### During the first six months, you will: \n\n* Understand customer needs and business goals. \n* Often act as a technical lead for features or epics and complete features or epics where the approach is loosely defined and requires technical & design discovery prior to implementation\n* Advocate for best practices and a healthy balance of tech debt versus delivery\n* Actively mentor/coach less-experienced team members\n* Ensure code is flexible, reusable, extensible performant, and high quality through feedback on code reviews\n* Decompose outcomes into solutions composed of multiple software components interacting with each other\n* Understand and consider technical dependencies\n* Provide feedback via decision-making frameworks for proposed changes from across the org\n* Work within the scope of a team and participate in driving cross-team collaboration \n* Build something that you are proud of\n* Learn something that you are excited about\n* Do the best work of your career so far\n* Find innovative ways to increase the quality and velocity of your work\n* Exercise creativity to solve unique challenges\n* Demonstrate passion for writing quality software\n* Demonstrate software quality through unit and integration test automation\n* Strengthen your team by sharing your knowledge and interests with others\n* Build relationships and communicate with various types and levels of stakeholders across the organization\n* Analyze and spearhead improvements to the systems and software that are important to your team\n* Manage risks, escalate priorities and help to resolve issues that could impact production quality  \n\n### Required Experience:  \n\n  \n\nBachelor's Degree in Computer Science, Engineering, Technology-related field, or equivalent experience\n\nHands on experience with at least some of the following:\n\n* React/Angular or similar modern client-side framework\n* Building and deploying RESTful APIs\n* Microsoft SQL Server or similar relational database management system\n* Focus on quality, including experience writing comprehensive test suites\n* Be familiar with modern architectures such as microservices and operational tools such as DataDog\n* At least 5 years overall experience specifically in object-oriented design and development preferably in C#\n* Amazon Web Services offerings such as Lambda, DynamoDB, CloudFormation stacks are a plus \n\n### EEO and accessibility Statement\n\nPaylocity is an equal opportunity employer.\n\n*Paylocity is committed to the full inclusion of all individuals. We comply with federal and state disability laws and make reasonable accommodations for applicants and employees with disabilities. To request reasonable accommodation in the job application or interview process, please contact accessibility@paylocity.com.*\n\n\n\nThis role can be performed from any office in the US. The pay range for this position in Colorado is $84,487 - $182,372/yr; however, base pay offered may vary depending on job-related knowledge, skills, and experience. This position is eligible for an annual restricted stock unit grant based on individual performance in addition to a full range of benefits outlined here. This information is provided per the Colorado Equal Pay for Equal Work Act. Base pay information is based on market location. Applicants should apply via www.paylocity.com/careers.",
      "datePublished": 1665920136502,
      "companyName": "Paylocity",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Schaumburg, Illinois",
      "offersRemote": true,
      "remoteLocations": ["United States"],
      "tags": ["angular", "react.js", "c#", "sql server"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "dyHOuptiddeR",
      "link": "https://jsjobbs.com/javascript-jobs/dyHOuptiddeR-staff-engineer-webassembly-tooling-reddit-inc",
      "title": "Staff Engineer, WebAssembly Tooling",
      "description": "Our mission is to bring community and belonging to everyone in the world. Reddit is a community of communities where people can dive into anything through experiences built around their interests, hobbies, and passions. With more than 50 million people visiting 100,000+ communities daily, it is home to the most open and authentic conversations on the internet. From pets to parenting, skincare to stocks, there’s a community for everybody on Reddit. For more information, visit redditinc.com.\n\nReddit is a platform that both celebrates and benefits from our user's creativity, and we're working on a new canvas for them to paint with. Tens of thousands of developers are already building against our API, but we can do so much more.\n\nThe Developer Platform team's goal is to allow communities to find and install Apps that completely customize & transform members' experiences and interactions. Everything's on the table, including comment sorting, custom post types, and more. Many communities will become immersive, game-like experiences.\n\n### There's many low-hanging fruit: \n\nr/photoshopbattles should have an image gallery, so you don't have to click your way down the comments. r/nba should have live-updating scores. Meme generators should be everywhere. r/wallstreetbets should have stock tickers. Comments should rank people you interact with higher. Subreddits should be easy to theme.\n\nBut there's also opportunities for exploration and weirdness. What does reddit-style fantasy football look like? Did you lose The Game?\n\nThis vision takes everyone on Reddit working together. The Developer Platform team will be building core platform capabilities that will allow us to reach for this vision.\n\n### What We’re Working On\n* Building an environment for executing dangerous Javascript and Webassembly safely on multiple platforms.\n* Building multi-tenant APIs for storage, pubsub, schedulers, and orchestration.\n* Building the technical foundation for future features and experiences.\n* Building a platform that is highly available, low on latency, and at internet scale.\n\n### What We Can Expect From You\n* Likely 7+ years of industry experience, preferably in backend, infrastructure, developer tools, or app platforms.\n* You've made significant contributions to a technically complex system, such as a database, container orchestration system, etc and can explain your contributions in detail.\n* Excellent communication skills. You must be able to collaborate effectively with teams in a fully-remote environment, and discuss complex topics with technical and non-technical audience \n\n### Responsibilities\n* Architect, build and maintain a next-generation WebAssembly environment. We're currently building in V8 Isolates with custom orchestration, but we're looking for you to tell us what the future holds.\n* This is an architect-level role, but please expect to code 60%+ of the time.\n\n**Bonus Points**\n* Compiler toolchain experience, especially LLVM\n* Kubernetes contributions\n* Contributions to Javascript bundling and/or build tools.\n* You've been a part of a team that has differentiated on developer experience, such as Heroku, Vercel, etc.\n\nReddit is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at ApplicationAssistance@Reddit.com.",
      "datePublished": 1665832491901,
      "companyName": "Reddit, Inc.",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["vercel", "javascript", "heroku", "kubernetes", "API"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "SMaBxvdnobrevO",
      "link": "https://jsjobbs.com/javascript-jobs/SMaBxvdnobrevO-senior-full-stack-developer-overbond",
      "title": "Senior Full Stack Developer",
      "description": "**Overbond** is a developer of artificial intelligence (AI)-driven real-time data streams for bond trading automation. Overbond offers the most advanced bond trading data streams and execution management system (EMS) in the market. The Overbond data streams and analytics can be integrated into the systems and workflow of any and every fixed income trading desk in the world.\nOverbond helps fixed income trading desks overcome the lack of a complete and centralized pricing and transaction data source for the bond markets, execute more client trades, increase the profitably of the trades that are executed, conduct pre-trade and post-trade analyses, monitor prices and risk and prepare reports.\n\n**Overbond is headquartered in Toronto and serves trading desks in the Americas, Europe and Asia.**\n\n### The Opportunity\n\nThis exciting new role is available as part of the Overbond engineering team expansion. The position is a unique opportunity to build creative solutions for complex problems using cutting-edge technology. As a member of our team, you will be contributing to a suite of products serving the largest capital markets in the world. We are looking for professionals who are passionate and excited about innovative technology, and have advanced knowledge and experience with application and data architecture, microservices and front-end development, automated testing, and CI/CD.\n\n### What You'll Do\n\n* Design and build low latency applications/services using Python and Java.\n* Deploy and run solutions leveraging Google Cloud infrastructure and technologies like Dataflow, Pub/Sub, and BigQuery.\n* Create and maintain real-time web applications using Angular and Python.\n* Design and develop APIs and integrations.\n* Define and implement best practices for architecture, design, and coding.\n* Lead and mentor a team of software engineers using agile development practices.\n\n### What You'll Need\n\n* 5+ years of full-stack development experience.\n* Extensive experience with Python, Java, React/Angular, JavaScript, and SQL.\n* Familiarity with the GCP suite of services and/or their open source counterparts.\n* Firm understanding of software development best practices such as source version control, automated unit testing, code reviews, CI/CD, etc.\n* High attention to detail.\n* Outstanding communication skills.\n\n### Nice To Have:\n* Relevant technology certifications.\n* Experience with capital markets.\n\n### What We Offer\n* Opportunity to build a complex SaaS product with very demanding enterprise clients\n* Learning and self-development opportunities through online courses and knowledge sharing lecture sessions.\n* Extended health coverage (Dental, Vision, and Drug plans, and other medical services)\n* Life Insurance and AD&D coverage\n* Health & Wellness program\n* Monthly team lunches and social events\n\nThe successful candidate(s) will have a truly exciting opportunity to be part of the industry-leading financial technology company changing the way how global investment banks, institutional investors, corporations, and governments access the capital markets. The candidate will work with top-notch industry professionals and will be given ample amount of opportunities to learn and contribute.",
      "datePublished": 1665831902852,
      "companyName": "Overbond",
      "companyLogo": "",
      "countryName": "Canada",
      "countryAbbreviation": "CA",
      "state": "Toronto",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["sql", "react.js", "java", "angular", "python"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "CljvqbtiKFDPSP",
      "link": "https://jsjobbs.com/javascript-jobs/CljvqbtiKFDPSP-web-backend-team-manager-pspdfkit",
      "title": "Web Backend Team Manager",
      "description": "PSPDFKit is the leading document processing and manipulation platform for developers and enterprise businesses. Our customers use our offering for creating, editing, signing, and collaborating on documents in their applications across mobile, Web, and all major platforms. Nearly a billion end-users in over 150 different countries rely on PSPDFKit every day including industry leaders like Dropbox, DocuSign, SAP, IBM, Volkswagen, Fabasoft, Wolters Kluwer Deutschland, and the European Patent Office.\n\nIn 2021, **PSPDFKit** announced its first strategic growth investment led by Insight Partners, a New York-based global venture capital and private equity firm focused on growth-stage software and technology companies. Insight’s investment, which totals more than $115 million, is being used to accelerate product growth, sales & marketing efforts, and fund strategic acquisitions, further expanding the capabilities of PSPDFKit’s highly adopted document processing platform.\n\nThe Server and Services team is responsible for building and maintaining a few server-side products (both SaaS and on-premise) written primarily in the Elixir programming language.\n\n### What you will do...\n* As a Web Backend Team Manager your objective is to make sure that the Server and Services Team keep fulfilling its company mission with excellent performance.\n* You will work directly with team members to define team objectives, workflows, and projects.\n* Maintain regular 1-on-1s and quarterly reviews with team members to define personal objectives, work on individual performance goals, and match company objectives with personal ambition.\n* Supervise team projects to make sure their execution remains in line with company objectives.\n* Delegate and assign team tasks that leverage individual strengths or aspirations.\n* Plan hiring in order to anticipate potential scaling issues.\n* Maintain shared knowledge in the team, and structure necessary training.\n\n### About You...\n* 3 or more years of experience working on backend services and cloud technologies.\n* 3 or more years of experience managing a team of developers.\n* Experience in leading projects that require coordination of multiple teams.\n* Experience coaching and training more junior team members.\n* Ability to effectively provide/receive feedback - both positive and negative.\n\n### We Value...\n\n* Continuous Improvement — We are continually growing and adapting, both as a company and as individuals; we believe the best is yet to come. We aim to learn from our mistakes, streamline our work, and remain accountable to each other.\n\n* Feedback — We value honest feedback, open collaboration, and relying on one another to continuously improve. We’re committed to listening to new ideas, being open to failure, and allowing ourselves to change our minds.\n\n* Transparency — We default to transparency in communication. We believe the ego doesn’t belong in the workplace, and that being open and honest in our communication builds and solidifies trust. We don’t shy away from the hard questions, and we welcome the opportunity to be candid.\n\n* People — We believe it’s always about people: our people and our customers. We care about each other, we trust one another, and we’re excellent to each other. We’re committed to going out of our way to help our colleagues become the best version of themselves — personally and professionally.\n\n* Creativity — We understand the world is constantly changing, so we’re on a mission to explore, experiment, and readily embrace the latest technologies. We support each other in our curiosity and creativity, because we know it unlocks empathy and enables new ways of thinking.\n\n* Character. — We care about quality and we aim to get things done the right way. We believe it’s our responsibility to make the world a better place, and our commitment to helping the environment means reducing waste and coming up with creative solutions for replacing paper processes.\n\nPSPDFKit is an equal opportunity employer with people from many different cultures and countries. We celebrate diversity and are committed to building a team that represents a variety of backgrounds, skill sets, perspectives, as well as providing our employees with a work environment free of harassment.\n\nWe do not discriminate on the basis of race, color, religion, age, marital status, national origin, ancestry, physical or mental disability, medical​​​ condition, sexual orientation, gender identity or ​expression, or any other non-merit factor. We’d especially love to receive applications from individuals who are underrepresented in the tech industry.",
      "datePublished": 1665830421115,
      "companyName": "PSPDFKit",
      "companyLogo": "",
      "countryName": "Austria",
      "countryAbbreviation": "AT",
      "state": "Vienna, Austria",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["aws", "typescript", "node.js", "azure", "python"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "JZBIt5susneC",
      "link": "https://jsjobbs.com/javascript-jobs/JZBIt5susneC-senior-full-stack-engineer-census",
      "title": "Senior Full-Stack Engineer",
      "description": "**Census** is how data teams at companies like Figma, Notion, Rippling, Clearbit, and Fivetran build better business operations.\n\nWith Census, analysts can turn their data warehouse into a single source of truth and publish their insights directly into the apps that marketing & sales teams use daily. With live data, these teams can build better campaigns, understand what users are doing, and ultimately drive more sustainable revenue.\n\nWe're a hybrid team headquartered in San Francisco who love taking annoying problems most people avoid and building simple solutions for them. We believe that data should be used for more than just making charts. This is why we built the first integration platform that works directly within cloud data warehouses.\n\n### Your Mission \nAs a Senior Full-Stack Engineer at Census, you'll be working closely with the founders and the engineering team to create and scale a data platform to billions of records.\n\n**We have a small team of engineers with decades of industry experience from places like Amazon, Google and Dropbox as well tons of startup experience (we have 6 former YC founders on staff).**\n\n* If you are looking for a role where you can influence both the company culture and product experience, read on.\n\n### Your responsibilities \n* You will make contributions to all parts of our tech stack, which is comprised of Rails, Typescript, Vue, Heroku, and AWS.\n* You will work closely with our product team to help design and develop new features.\n* You will inform much of our early culture and be part of creating a truly special team.\n* You will be an active member of our sprint process - we do short sprint plans once every two weeks and 20 minute daily virtual standups.\n* You won't burn out – we are building a great product while creating a fun, family-friendly culture.\n* You will learn some of our lingo, like \"do nothing\", \"done done\", \"ponies\" and \"ur-*\"\n\n### Our ideal candidate\n* Has deep experience with Ruby on Rails or with high-scale data systems.\n* Can build things end-to-end. Our engineers build, deploy and maintain their code.\n* Has a Bachelor's degree in CS, Engineering, Math or equivalent experience.\n* Thrives in small company / ambiguous environment where you get to work directly with customers and make decisions that have a huge impact on the business.\n\n### Our benefits \n* Competitive Bay Area salary and equity\n* Health, dental, and vision insurance (full platinum coverage for dependents)\n* Laptop, monitor, and accessories\n* Flexible time off (20+ days/year recommended)\n* Parental leave\n\nCensus is an equal opportunity employer and we value diversity and inclusion at our company. We welcome people of different nationalities, backgrounds, experiences, abilities and perspectives.",
      "datePublished": 1665829001647,
      "companyName": "Census",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco, CA",
      "offersRemote": true,
      "remoteLocations": ["North America"],
      "tags": ["aws", "typescript", "vue.js", "heroku", "ruby"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "C0kiZtlacitirC",
      "link": "https://jsjobbs.com/javascript-jobs/C0kiZtlacitirC-senior-react-developer-critical-mass",
      "title": "Senior React Developer",
      "description": "The Critical Mass technology team is looking for an inspired, motivated, and experienced senior web developer to join our team. We are an experience design agency with a focus on the customer, which means that multi-discipline collaboration and prototyping are at the heart of our process. \n\nThis role will join a talented team working on Nissan and Infiniti. We're using the latest technologies including React, GraphQL, Gatsby and a clean component-based approach to deliver reusable, innovative, and responsive experiences. Web performance & accessibility are also key concerns because of their respective importance to user experience and perception of a premium experience.\n\n### You Will\n\n* Collaborate with Design and UX to prototype user interactions\n* Mentor other front-end developers\n* Ensure compatibility of code across devices and viewport sizes\n* Assess and optimize page performance and WCAG compliance\n* Work with delivery team to ensure overall quality of the experience and support this with tests and documentation\n\n### You Have\n\n* Strong communication skills with a team-centric approach to discussion and decision making within a distributed team.\n* Experience building creative experiential sites with frameworks such as: Three.js, GreenSock, etc.\n* Expertise in JavaScript - specifically with ES6, and React.\n* Experience using HTML5 semantic markup, CSS3, and CSS3 & code-based animation on responsive consumer-facing websites.\n* Full command of Git, the terminal, continuous deployment and integration, and other modern fundamentals.\n* Strong troubleshooting ability and technical analysis skills - web performance optimization included.\n* WCAG accessibility experience is preferred.\n* Agency experience preferred.\n\n### You May Have\n\n* WebGL/GLSL experience\n* VR/AR experience\n* Unity/Unreal\n\n**Critical Mass is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We do not tolerate discrimination on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. If you are an individual with disabilities who would like to request an accommodation, please reach out to accommodations@criticalmass.com.**",
      "datePublished": 1665751626322,
      "companyName": "Critical Mass",
      "companyLogo": "",
      "countryName": "Canada",
      "countryAbbreviation": "CA",
      "state": "Calgary",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["html", "react.js", "git", "css", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "ZrsHWPrewoP",
      "link": "https://jsjobbs.com/javascript-jobs/ZrsHWPrewoP-developer-front-end-remote-in-canada-power-factors",
      "title": "Developer, Front End (Remote in Canada)",
      "description": "### ABOUT POWER FACTORS\n\nPower Factors develops software that accelerates the global energy transition by empowering all renewable energy stakeholders to collaborate, automate critical workflows, and make the best decisions. Power Factors fights climate change with code.\n\nPower Factors has incorporated its three flagship solutions Drive, Greenbyte, and BluePoint to build an integrated suite of open and smart apps. These apps are purpose built for asset management, field service optimization, and performance optimization. Leveraging the domain expertise and machine learning-based advanced analytics within these apps, customers can maximize the value of their renewable assets to stay competitive.\nPower Factors’ renewable energy software platform is one of the most extensive and widely deployed solutions in the market with nearly 200 GW of wind, solar, hydro, and energy storage assets managed worldwide.\n\nLearn more at powerfactors.com.\n\n\n### ABOUT THE ROLE\n\nWe are looking for an experienced Front-End Developer to join our development group in building and improving our SaaS platform. As a Front-End Developer you will be part of a team of 4 talented colleagues and work at designing, implementing, testing, monitoring, debugging, refactoring, and optimizing our UI framework and platform to manage Clean Energy assets in the industry.\n\nAs a Developer, you will also have an important role to play within your team. You’ll leverage your skills to achieve team objectives, mentor others, strategize to maximize the value delivered, acquire, and share knowledge, bring energy and fun, identify and reflect on team’s issues, contribute to continuous improvement process.\n\nOur platforms collect millions of IoT data points, sanitize them, detects occurring issues, identifies leading indicators to predict future issues, and implement advanced analytic capability on top of this rich high value dataset. In addition to issue detection and analytics, our platform adds the toolsets needs to take analytic insights to action such as case management and work order management.\n\nYou will be working remotely, from home in Canada, with an international team (US, Canada, Europe, India, Philippines, Sweden).\n\n\n### WHAT YOU WILL BE DOING\n\n* Work with UI/UX designer and Design Team to bridge the gap between graphic design and technical implementation, taking a role on both sides and defining how the application looks as well as how it works\n* Translate the UI/UX design wireframes to actual code that will produce visual elements of software application.\n* Ensure the technical feasibility of UI/UX designs and optimize for maximum speed and scalability\n* Be part of our product development life cycle; code, unit tests, code review, planning, retrospective\n* Act as a front-end specialist; stay on top of latest technologies and practices, mentor other developers\n* Acquire and maintain an Agile mindset; maximizing value delivery, high focus on code quality for you and your team, contribute to team’s continuous improvement effort, healthily challenge solutions and status quo\n* Acquire and keep a good understanding of the renewable industry\n\n\n### WHAT YOU WILL NEED TO BE SUCCESSFUL\n\nWe believe you enjoy working in a purpose-driven organization and that you thrive in an environment where you need to find creative solutions to challenging problems in a fast-changing context. This also means that you are effective at managing multiple projects of varying complexities, driven by continuous learning and growth. Specifically, we are looking for someone with the following background:\n\n* Degree in Computer Science, software engineering or equivalent experience\n* Minimum of 5 years of related experience in front-end web development technique such as TypeScript, JavaScript, CSS, HTML, React framework or equivalent (React preferred)\n* Good understanding of Agile mindset and Framework (Delivering value, not just code)\n* Familiar with Git, Jira and Confluence\n* Result oriented with attention to details\n* Able to rally to team or organization decisions under adversity\n* Curious and proactive about new trends in technology\n* A product-minded developer who cares about the \"Why\" - Why build this feature? How will we measure impact?\n* Bilingualism (French) is highly preferred.\n\n### Nice to have:\n\n* Knowledge of Cloud programming and infrastructure as code (AWS, Azure, Docker, Kubernetes)\n* Knowledge of C#, SQL, PostgreSQL, and CI/CD Pipelines\n* Experience with Redux\n* Experience with Storybook\n\n\n### LIFE @ POWER FACTORS\n\nWe are an agile software development company – big enough to make an impact, but small enough to move quickly and execute in a growing industry, taking advantage of rapidly evolving technologies. We are a collective of bold and ingenious talents driven by results. Our team is made up of hard-working, fun-loving people who are passionate about making the world a better place. We seek fierce and humble people to help us achieve our ambitious plan.\n\n\n### WHY JOIN US\n\n* A humble cause with a clear purpose –you will help us fight climate change with </code> every day at work. We aim to be environmentally conscious in all aspects of our operations.\n* Work with passionate experts and top-talents in your field –we are proud of our highly skilled crowd and the savviness each of us brings to the team.\n* Friendly and uplifting atmosphere –we believe kindness and respectfulness is core for our culture. A friendly smile or a helping hand is never far away.\n* Flexible hours and workplace –it is the result that counts, not when or where. Our hybrid/remote work setup allows everyone to set themselves up for success and create a more sustainable work-life balance.\n* All the benefits you expect (and more) –besides the basic benefits (adopted to local needs and norms), you will enjoy perks such as 8h of paid volunteering per year and participation in our Corporate Bonus Program (to name a few).\n\n\n### WE ARE AN EQUAL OPPORTUNITY EMPLOYER\n\nPower Factors is an Equal Opportunity Employer committed to engaging a diverse workforce and sustaining an inclusive culture. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
      "datePublished": 1665751120420,
      "companyName": "Power Factors",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco, CA",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["javascript", "react.js", "postgresql", "git", "typescript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "o94pmjatsniK",
      "link": "https://jsjobbs.com/javascript-jobs/o94pmjatsniK-senior-javascript-developer-kinsta",
      "title": "Senior JavaScript Developer",
      "description": "At **Kinsta** we aim to create truly effective solutions for our customers and internal teams. We believe the only way to maintain and scale our standards is to focus on quality code. We are looking for a seasoned senior JavaScript developer who wants to work with a 100% remote,  globally distributed company. We work with an ownership-embracing, highly skilled team in a relaxed environment where culture is as important as technical excellence. \n\nAs part of our JS Development Team, you will be working with some of the most exciting JavaScript tools on the market to build our client-facing and internal tools.\n\n### Our Stack:\n**TypeScript, React, Node.js, GraphQL, SQL, NoSQL, Webpack, Babel, SWC, Jest, Storybook, GitHub, Docker, Stripe**\n\n### Responsibilities and Challenges:\n\n* You will be tasked with contributing to and eventually leading a diverse set of projects that immediately impact our customers' experience, our internal teams' day-to-day, and thus our business as a whole.\n* We rely heavily on communication between all team members, regardless of team or department lines. As a Kinsta developer, you will be communicating with the Design, QA, Marketing, and Support teams to provide and solicit feedback.\n* We strive to implement a bottom-up approach, hand in hand with an ownership mentality. Our goal is to give each developer as much freedom as possible with the capacity, knowledge, and willingness to make decisions that matter.\n* We implement a robust review process to ship quality code. All developers are expected to participate in code reviews to ensure accountability and stability, share knowledge, and learn from peers.\n\n### About You:\n\n* You have a minimum of 5 years of hands-on experience with JavaScript, including backend and frontend.\n* Experienced with backend-focused JS (e.g., Node.js, Express).\n* Experienced with React or other modern frontend frameworks (eg: Vue, Angular, Svelte).\n* Experienced with modern JS/TS tools (Babel, SWC, esbuild, current ES standards).\n* Experienced with statically typed languages or typing tools for JS (Typescript, Flow, Elm).\n* Experienced with databases (SQL or NoSQL).\n* Experienced with git and team collaboration via pull requests.\n* Experienced with JS testing frameworks (Jest, Mocha).\n* Experienced with frontend build tools (Webpack, Rollup, Vite).\n\n### Bonus points:\n\n* Experience with web hosting, server infrastructure, or server management.\n* Familiarity with Cloudflare and its API.\n* In-depth experience with the Stripe API.\n\n### Benefits:\n\n* We have a fully remote culture with a globally distributed, international team. You can work anywhere with appropriate internet access.\n* To ensure that everyone has time to rest and recharge, we offer Flexible paid time off.\n* We offer flexibility with work hours. \n* Remote expense budget and personal career development budget.\n* Due to the ownership mentality, developers participate in projects from conception to deployment.\n* Everyone has a voice in the development process, and we welcome ideas, thoughts, and constructive criticism.\n* We have an amazing product design (UX and UI) team, and tasks are thoroughly researched and designed before development begins.",
      "datePublished": 1665747922613,
      "companyName": "Kinsta",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "West Hollywood, California",
      "offersRemote": true,
      "remoteLocations": ["Europe", "Africa"],
      "tags": ["typescript", "node.js", "nosql", "sql", "graphql"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "V2icJfyfixorP",
      "link": "https://jsjobbs.com/javascript-jobs/V2icJfyfixorP-senior-front-end-developer-long-term-job-proxify-ab",
      "title": "Senior Front-end Developer: Long-term job",
      "description": "### The Role:\nWe are searching for a Senior Front-End Developer (Angular.js/React.js). You can be a perfect candidate if you are growth-oriented, you take pleasure in your work, and you enjoy working on new ideas to develop exciting products. By joining Proxify, you will get considerable opportunities to work with leading brands and amazing startups to build their next product and growth features. \n\n\n### What we are looking for:\n\n* You have +3 years experience with React.js/Angular.js;\n* You follow best practices and conventions;\n* Relevant experience in CI/CD and related tools;\n* Responsible and able to work with minimal supervision;\n* Upper-intermediate English level;\n* You can communicate well with both technical and non-technical clients.\n\n### Nice-to-have: \n\n* Timezone: CET (+/- 3 hours);\n* Basic back-end knowledge for minor back-end jobs where necessary.\n\n### Responsibilities:\n\n* Build reusable code and libraries for future use;\n* Ensure the technical feasibility of UI/UX designs;\n* Transform visual designs and wireframes into working products;\n* Accurate planning of the feature delivery;\n* Collaborate with other team members and stakeholders\n\n\n### What we offer:\n\n* 100% remote work: Work from anywhere.\n\n* Flexibility: The ability to change the project to another one.\n\n* Financial growth: Competitive compensation and performance-based increases.\n\n* Freedom: Very flexible working schedule.\n\n* 360 degree growth: Opportunities for professional development and personal growth.\n\n\n### Your benefits with Proxify:\n* Be part of Proxify community: Network with like-minded and enthusiastic individuals to make a difference. \n* Make an impact: You get the opportunity to work on the projects that inspire you and add value to your career.\n* Transparency: Contracts with transparency in earnings and working hours.\n* Save your time: Fast and efficient hiring process to match you with the project of your preference.\n* Ownership: Take ownership of your work and enjoy more freedom in your career.",
      "datePublished": 1665747352681,
      "companyName": "Proxify AB",
      "companyLogo": "",
      "countryName": "Sweden",
      "countryAbbreviation": "SE",
      "state": "REMOTE",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["github", "react.js", "angular"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "NvufCCaroruA",
      "link": "https://jsjobbs.com/javascript-jobs/NvufCCaroruA-software-engineer-frontend-remote-aurora-solar",
      "title": "Software Engineer, Frontend (Remote)",
      "description": "Aurora Solar is a fast-growing Series C company on a mission to create a future of solar energy for all. Aurora makes the software that is enabling society to transition to a world powered by solar power. It’s our goal to have every solar installation in the world pass through our software, which has already been used to design millions of solar projects. Named one of “The Best Places To Work in 2021” by BuiltInSF.com and awarded #1 Solar Software platform by Solar Power World, Aurora is disrupting the energy industry and changing the course of history. \n\nWe are looking for a frontend software engineer who will help take our cloud-based solar design software, which is used by thousands of solar companies worldwide, to the next level of functionality and interactivity. If you are interested in bringing cutting-edge design methods to a fast-growing solar industry and want to help society transition to a more sustainable future, we would love to hear from you!\n\nWe are a diverse team based in San Francisco, passionate about advancing the growth of solar energy. If you are looking for a stimulating and fulfilling role, come join us!\n\n### What you'll do:\n* Build new functionality for our industry-leading solar design platform\n* Spearhead the development of new greenfield products\n* Write high quality, well-tested code\n* Implement, guide, and influence Aurora Solar’s front-end engineering practices\n\n### What we value:\n* 2+ years of experience building maintainable, clean, and well-tested user-facing code\n* Love writing Javascript or TypeScript (React, Redux, Styled Components experience a plus)\n* Great engineering skills and strong computer science fundamentals\n* Excellent teamwork and communication skills\n* Thoughtful balance between shipping code quickly and adhering to best practices\n* Ability to perform and thrive in a fast-paced environment\n* Familiarity with full-stack development is a bonus\n\nThank you for your interest in Aurora Solar. Currently, our interview process is taking longer than usual as we navigate the new normal of COVID-19. We appreciate your patience and look forward to speaking with you soon.\n\nAurora is dedicated to building a diverse and inclusive workforce of people who believe in and are passionate about creating a future of solar energy for all. We are an equal opportunity employer, we welcome and consider qualified applicants regardless of gender identity, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences. We encourage you to apply even if you feel that you do not meet all of the above criteria!",
      "datePublished": 1665746745861,
      "companyName": "Aurora Solar",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco, CA",
      "offersRemote": true,
      "remoteLocations": ["North America"],
      "tags": ["typescript", "react.js", "redux", "jest"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "QtmZjQylbatoN",
      "link": "https://jsjobbs.com/javascript-jobs/QtmZjQylbatoN-remote-full-stack-engineer-notably",
      "title": "Remote Full Stack Engineer",
      "description": "**Notably** is growing our team of people on a mission to make research a part of everyday work. We help teams collect, analyze, and share qualitative research.\n\nNotably is an inclusive and supportive team that trusts and respects each other. We bring our whole selves to work and celebrate what makes us unique. We’re an early-stage startup with a high bar for excellence & productivity, but we leave ego, competitiveness, and hustle culture at the door. We believe in creating a calm and inviting workplace culture so that we can all thrive and do our best work and still have plenty of time to refuel our energy.\n\n### Some projects you could work on:\n\n* The split-screen infinite canvas and table workspace in Notably where researchers analyze qualitative data.\n* Enhancing the canvas experience with new tools and collaboration.\n* Exploring new ways to visualize qualitative data with a quantitative lens that could help researchers make meaning out of the mess.\n* Combining machine learning and AI with research frameworks and best practices to create an experience that will super power our researchers.\n* Solving for performance and memory optimizations– we want to keep pushing the limits of what’s possible while maintaining high performance.\n* Improving core features like search, transcriptions, content management, and more.\n* We’d love to hear from you if you have:\n* At least 3 years of professional experience shipping features or products as a full-stack developer.\n\n### Demonstrated fluency with the following:\n* Typescript, React, GraphQL, and Node.\n* Experience with automated testing frameworks and TDD in Javascript.\n* Experience with the following is a plus:\n* Familiarity with Postgres, AWS.\n* Experience building real-time collaboration tools\n* Experience using HTML canvas\n* Background in AI, NLP, or data science.\n* Proactive and strong verbal and written communication skills.\n* A desire to work in a startup: high impact and experimental.\n* An interest in mentorship, learning from others, and digging into new challenges.\n* A collaborative vision of the product process. Every member of our team is involved from ideation to implementation.\n* A healthy skepticism and curiosity. Comfortable saying “I don’t know” and participating in research calls with users.\n\n### Our hiring process:\n\n* The end-to-end hiring process will take a couple of weeks and includes:\n* An initial call with our CPO and founder.\n* A virtual interview with your future teammates.\n* A paid take-home project (that could be completed in a day) and practical technical screen with our engineering team.\n* If you’re excited about this role but your past experience doesn’t align perfectly with the points outlined in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.\n\n### Timezone requirements:\n\nThis is a fully remote position, however, candidates must either be based out of Europe (our technical lead is in Georgia) or in the Eastern timezone in US. Candidates who don't match this preference will not be considered for this role.\n\n**Pay & benefits:**\n\n* Competitive salary & equity\n* Remote-first\n* Generous PTO\n* Learning & development stipend\n* Work from home stipend\n* Company on-sites",
      "datePublished": 1665746318820,
      "companyName": "Notably",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "REMOTE",
      "offersRemote": true,
      "remoteLocations": ["United States", "Europe"],
      "tags": ["javascript", "node.js", "react.js", "graphql"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "kZPHbJtnirpregniF",
      "link": "https://jsjobbs.com/javascript-jobs/kZPHbJtnirpregniF-senior-full-stack-developer-fingerprint",
      "title": "Senior Full Stack Developer",
      "description": "Remote\n\n**Fingerprint** empowers developers to stop online fraud at the source.\n\nWe work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. Some of our customers include: Coinbase, Booking.com, Yahoo, and eBay just to name a few.\n\n**We are a globally dispersed, 100% remote company** with a strong open-source focus. Our flagship open source project is Fingerprint (16K stars on GitHub).\n\nWe have raised $44M and are backed by Craft Ventures (previously invested in Tesla,  Facebook,  Airbnb), Nexus VP (previously invested in Postman,  Hasura) and Uncorrelated Ventures (previously invested in Redis, Rollbar & Gradle).\n\nWe’re looking for a senior full-stack developer to help us build a high performance, high accuracy online fraud prevention service. We need someone who has experience building server-side APIs.\n\n### What we’re looking for :\n\n* Excellent understanding of Internet security & privacy mechanisms\n* Proven experience in API architecture and implementation\n* Experience using React on the Front End\n* Good understanding of PostgreSQL \n* Familiarity with message queues\n* Test-driven mindset\n* Good English.\n\n### An ideal candidate will also have:\n\n* Familiarity with AWS\n* Startup Experience\n\n### Our stack:\n\n* Backend: TypeScript, Node, Express.\n* Frontend: TypeScript, React, Storybook.\n* AWS (Elastic Beanstalk, RDS/Aurora, SQS)\n* Netlify/CloudFront.\n* PostgreSQL.\n\nOffers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.\n\nWe are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.",
      "datePublished": 1665700412588,
      "companyName": "Fingerprint",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Chicago, Illinois",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["react.js", "API", "postgresql"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "BWZc2ctnirpregniF",
      "link": "https://jsjobbs.com/javascript-jobs/BWZc2ctnirpregniF-senior-frontend-engineer-fingerprint",
      "title": "Senior Frontend Engineer",
      "description": "Remote\n\n**Fingerprint** empowers developers to stop online fraud at the source.\n\nWe work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies. Some of our customers include: Coinbase, Booking.com, Yahoo, and eBay just to name a few.\n\n**We are a globally dispersed, 100% remote company** with a strong open-source focus. Our flagship open source project is Fingerprint (16K stars on GitHub).\n\nWe have raised $44M and are backed by Craft Ventures (previously invested in Tesla,  Facebook,  Airbnb), Nexus VP (previously invested in Postman,  Hasura) and Uncorrelated Ventures (previously invested in Redis, Rollbar & Gradle).\n\nWe’re looking for a senior frontend engineer to maintain and improve our JavaScript agents (FingerprintJS and the browser SDK of Fingerprint Pro). This position doesn’t imply making user interfaces, it implies working with browser and server APIs. JavaScript agents are projects made by developers for developers with love.\n\n### Examples of Projects you may work on:\n\n* Design, document and implement new features of the JavaScript agents\n* Conduct experiments with the agents\n* Use native browser JavaScript APIs (we use few third-party libraries in runtime)\n* Push TypeScript and other tools to their limit\n* Contribute to an OSS project with 17K+ stars and 23B+ monthly usages\n* Optimize the code (both size and performance)\n* Write unit tests for their code and check it manually\n* Work with engineers who develop the backend for the SDK\n* Make Node.js scripts that help build, test and update the agents\n\n### Requirements:\n\n* Strong TypeScript knowledge\n* Experience of writing asynchronous code with parallel execution\n* Being comfortable working with browser APIs (DOM, AJAX, page lifecycle events, etc.)\n* General understanding of the HTTP protocol and web security\n* Jasmine, Jest or a similar test framework\n* Passion for writing ideal code\n* High level of personal ownership and autonomy, which requires experience working without clearly defined requirements\n* Good English for verbal and written communications inside the company\n\n### An ideal candidate will also have:\n\n* Experience with Rollup\n* Experience configuring GitHub Actions\n* Deep knowledge of browser JavaScript APIs\n* Browser automation experience\n* Experience with Open API\n* Historical record of open source contributions\n* Experience with technical writing\n* Willing to learn something new\n\n### Our stack:\n\n* Backend: TypeScript, Node, Express.\n* Frontend: TypeScript, React, Storybook.\n* AWS (Elastic Beanstalk, RDS/Aurora, SQS)\n* Netlify/CloudFront.\n* PostgreSQL.\n\nOffers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.\n\nWe are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.",
      "datePublished": 1665699798779,
      "companyName": "Fingerprint",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Chicago, Illinois",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["typescript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "xzZ9PKwolfecioV",
      "link": "https://jsjobbs.com/javascript-jobs/xzZ9PKwolfecioV-senior-full-stack-engineer-voiceflow",
      "title": "Senior Full Stack Engineer",
      "description": "**Join our team**\n\nVoiceflow is the leading collaborative conversational AI platform.\n\nOur collaboration platform makes it easy for conversational AI product teams to quickly design, test, ship and iterate on conversational assistants - together, faster, at scale.\n\nAssistants designed and built with Voiceflow span hundreds of use cases, from drive thrus to in-car assistants, call centres and more. Voiceflow is loved by over 100,000 global teams with some of the world’s largest companies as customers including Google, BMW, US Bank, McDonalds, JP Morgan, Spotify, Amazon, Home Depot, Best Buy, John Hopkins, and thousands of others.\n\nWe’re biassed of course, but we think we’re building one of the coolest products in the world. Put this claim to the test and try out Voiceflow’s free version yourself - give it a try!\n\nJoining a new company is one of the biggest decisions we all make in life as we’re investing our most important resource - our time. At Voiceflow, we’re investing our time here because we believe in an inevitable future where many of the conversations we have with brands everyday will be increasingly automated. If that’s the future we’re all going to be a part of, then the world needs Voiceflow to ensure the teams building these conversational experiences have great tools to craft great experiences. Think of us like the Adobe creative suite for the growing world of conversational AI. You can learn more about our vision of the future here.\n\nWe’ve raised $25M USD the past 2 years from some of the world’s best investors including Felicis, Craft, True, Amazon, Google & CEOs of Figma, Webflow, Eventbrite, Invision, Producthunt, and more. We’re a small, fast growing remote team of around 45 team members from around the world, composed of dedicated and talented individuals with a core focus on engineering and product.\n\n### About The Role\n\nWe're looking for someone to bring our Machine Learning Models to life for our end users! As a Senior Full Stack Engineer, you'll be responsible for building out a new product area focused on NLU services and automation.\n\nYou'll work on building new visual components, real time systems & tools that small creators and large enterprises will love. You'll work with the product, design, ML and core engineering teams to help bring Voiceflow Machine Learning to life!\n\n**What we currently have**\n* A new product line launched as a beta\n* A real time collaborative canvas that's used by 100,000 teams!\n* Well defined front end patterns and components\n* A Comprehensive ML Strategy\n* A highly capable engineering team\n\n### What you'll do\n* Work with the design and ML teams to create awesome customer experiences\n* Lead the launch of a new product area that impacts 50 of the largest companies in the world\n* Help us build tools that make it easier for creators to design voice apps\n* Help architect new services and extend conversational capabilities\n* What you’ll bring\n* Strong experience in frontend engineering with React (HTML, CSS, JavaScript, TypeScript, npm, REST, and testing)\n* Experience building reliable APIs in Javascript or other languages\n* Familiarity with version control systems like Git\n\n### Nice To Have\n* Experience with socket.io and real-time collaborative workflows\n* Experience working with Node.JS\n* Experience building recommender systems\n* Experience with continuous integration and continuous deployment development workflows\n* Familiarity with Cloud Computing platforms such as AWS or GCP\n* Familiarity with the Alexa Skills Kit / Google Actions Console or Chatbots and IVR systems\n\n### Why Voiceflow\n* Work with a well-funded yet small, hard working team filled with brilliant passionate people.\n* Take ownership over your work and build momentum on important projects both assigned to you, and of your own choosing.\n* You choose where you work – from your home, the beach, an office, or through our WeWork global membership program.\n* Bi-weekly Team All-Hands, Social Hours, team bonding games, and more. Keeping our teams engaged, even in the remote world.\n* Supporting continued growth with Learning & Development and Lunch & Learn opportunities. Competitive salaries, equity options, full benefits from day one, WFH equipment budget and paid development - we’ve got you covered!\n* Realistic company valuation that gives your equity real, meaningful upside.\n* Supporting new hires by providing opportunities to participate in a Voiceflow Bootcamp where you receive one-on-one support to learn the ins and outs of our product.\n* Perks are nice, but perks don’t make a company or individual successful - the work does. At Voiceflow, we’re building a product that can help teams work together to rapidly design, prototype and launch conversational assistants for any channel. While you’re building for our customers, we’re building for you.\n\nVoiceflow is an equal opportunity employer. We believe that our commitment to diversity & inclusion will enable us to build better digital experiences for our clients and their customers. We are dedicated to fostering a global team that reflects the diversity of the Voiceflow community. We consider employment applicants without regard to age, race, color, national origin, citizenship, religion, creed, sex, sexual orientation, veteran status, marital status, disability status, or any other protected status.\n\nIf you have any special needs or accessibility requirements, please let us know. We will do our utmost to accommodate, in accordance with applicable local legislation.\n\n### How we hire\n\nAt Voiceflow, since we are a small and mighty team - we put a lot of care and time into who we hire. We take a hybrid approach when it comes to our recruitment process. We believe in a combination of conversational-style & standardized interviews along with take-home assessments for technical positions. We will ensure there is time at the end of all interviews for you to ask any questions and will keep an open-line of communication throughout the process.",
      "datePublished": 1665663255167,
      "companyName": "Voiceflow",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco,",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["css", "javascript", "node.js", "html", "typescript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "Jf0Za5lanimreT",
      "link": "https://jsjobbs.com/javascript-jobs/Jf0Za5lanimreT-senior-fullstack-engineer-terminal",
      "title": "Senior Fullstack Engineer",
      "description": "### About\n\n* CollegeVine was founded in 2013 in Cambridge, MA and reaches over 10 million families annually who are in the high school-to-college or college-to-career phases. Our roots are in delivering near-peer mentorship at scale, which has since evolved to delivering lifelong guidance with a focus on data and technology. We have raised over $42m in venture funding from dedicated investors such as Morningside Technology Ventures (Xiaomi, TikTok), the founding partner of 5Y Capital, Fidelity, University Ventures, and more. In 2020, after years of being a remote-friendly company, CollegeVine became a fully remote company centered on Eastern Time with a diverse cast of team members based predominantly in the United States, but also around the world. JD Content: About the Role (This section explains the importance of this role for our Client,Include relevant information to candidates: Industry, details on the team they’ll join, abilities required by the role.) We're the company that's showing millions of families how good guidance can materially change life outcomes. To make good guidance possible, we focus on consumer technology, encompassing everything from innovative applications of machine learning to elegant data-driven experiences to non-exploitative social media and a fast-growing marketplace—all while staying true to a distinctly human purpose: turning crucial milestones into life-changing opportunities.\n\n### About The Role\n\nWe're the company that's showing millions of families how good guidance can materially change life outcomes. To make good guidance possible, we focus on consumer technology, encompassing everything from innovative applications of machine learning to elegant data-driven experiences to non-exploitative social media and a fast-growing marketplace—all while staying true to a distinctly human purpose: turning crucial milestones into life-changing opportunities.\n\n**You Know You're Right For This Position If**\n* You seek ownership beyond your own work, and look to the product and company as a whole.\n* You are a self-starter and internally motivated, with a strong desire to be part of a successful team that shares your high standards.\n* You understand what it means to be entrepreneurial and resourceful. Perhaps you've launched your own side-project, worked at a startup, or helped a scrappy business grow quickly.\n* What you'll do\n* You will seek ownership beyond your own work, and look to the product and company as a whole.\n* You will be a self-starter and internally motivated, with a strong desire to be part of a successful team that shares your high standards.\n* You are comfortable working in an ambiguous and fast-paced environment.\n\n### What you bring\n\n* In addition to your awesome attitude and values, we're looking for someone with the following skills:\n* Expertise with multiple programming languages (Ruby, Javascript, Python, Haskell, Go, etc...), and you're excited to learn more\n* A track record of delivering high-value projects in fast-paced environments\n* Expert at full-stack web development, but we're agnostic to whether it's been more front-end or back-end focused\n* Excellent communication skills, particularly with non-technical team members\n* Comfortable breaking complex projects down into small pieces and creating implementation plans\n* 5+ years as a software engineer",
      "datePublished": 1665662585129,
      "companyName": "Terminal",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "San Francisco",
      "offersRemote": true,
      "remoteLocations": ["Canada"],
      "tags": ["ruby", "python", "typescript", "javascript"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "W60zF6sulumitS",
      "link": "https://jsjobbs.com/javascript-jobs/W60zF6sulumitS-remote-software-engineer-stimulus",
      "title": "Remote Software engineer",
      "description": "### About Stimulus\nStimulus is a social platform started by Sticker Mule to show what's possible if your mission is to increase human happiness.\n\n### We offer\n1. Remote work with flexible schedules\n2. A privately owned, low-stress culture.\n3. A fun \"no bullshit\" work environment\n\n### We like you to know\n1. Docker\n2. NextJS\n3. React\n4. NodeJS\n5. GraphQL\n6. Redis\n\n### Compensation and benefits\n1. Salary: $120k+ based on experience\n2. $20,000 signing bonus\n3. 4 weeks vacation + holidays based on your country of residence",
      "datePublished": 1665661960485,
      "companyName": "Stimulus",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Amsterdam, NY",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["javascript", "docker", "node.js", "react.js", "redis"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    },
    {
      "slug": "wIBw4jenOmetsyS",
      "link": "https://jsjobbs.com/javascript-jobs/wIBw4jenOmetsyS-remote-nodejs-and-python-software-engineer-remote-systemone-llc",
      "title": "Remote NodeJS and Python Software Engineer (REMOTE)",
      "description": "SystemOne is searching for a software developer to build & maintain new and existing client \napplications built using Python & Node.js targeting Raspberry Pi.\n \n### As an Applicant You are Expected to Have:\n● At least two years of professional software development experience building, deploying, and maintaining Python applications. \n\n● At least two years of professional software development experience building, deploying, and maintaining Node.js applications. \n\n● Proficiency with HTTP client libraries, TLS & SQLite. \n\n● Some experience working with serial comm devices from a linux platform. \n\n● Ability to work & communicate with the team in English. \n\n● Experience building deb packages for distribution & installation of software on remote linux computers. \n\n● Experience in setting up the infrastructure required to publish over-the-air updates to debian applications. \n\n● Experience using Git for source code control. \n\n● Experience writing unit tests in JavaScript & Python. \n\n● Familiar with debugging tools and methods.\n\n### Responsibilities: \n● Design client side applications that are targeted at Raspberry Pi devices. \n\n● Deploy updates and installation packages for applications running on Raspberry Pi devices. \n\n● Troubleshoot installation and runtime issues that are reported from remote locations. \n\n● Optimise HTTPs requests made from Raspberry Pi applications. \n\n● Build data upload workflows that are tolerant to partitions in the network. \n\n● Collect error and crash logs from a fleet of remote devices and monitor overall fleet health. \n\n● Make strategic technical decisions that cater for system flexibility through safe updates and configuration changes. \n\n● Write unit tests that integrate into deployment pipelines. \n\n● Collaborate with an excellent team of engineers to produce high quality, performant & secure information exchange back-ends for healthcare initiatives.\n\n● Document APIs and expected system behaviour.",
      "datePublished": 1665661639438,
      "companyName": "SystemOne, LLC",
      "companyLogo": "",
      "countryName": "United States",
      "countryAbbreviation": "US",
      "state": "Northampton, Massachusetts, USA",
      "offersRemote": true,
      "remoteLocations": ["Anywhere"],
      "tags": ["javascript", "python", "node.js", "sql"],
      "jobType": "FullTime",
      "minSalary": null,
      "maxSalary": null
    }
  ],
  "count": 212
}
